Repository: UniversityOfHelsinkiCS/mobvita
Catalog: client/util/translations/revita/*/LC_MESSAGES/messages.po
Languages: fi, it, ru

source: Sorry, Revita is unable to extract the story from this Web page. Please copy the text from the web page. If you would like to practice with this story, please save it into a .txt file on your computer and upload the text file.
fi: Pahoittelemme, Revita ei pystynyt poimia tarinaa tältä Web-sivulta. Olkaa hyvä ja kopioikaa halutun tekstin sivulta. Jos haluatte opetella kyseisellä tarinalla olkaa hyvä ja kopioikaa se tekstitiedostoon ja ladatkaa se sivullemme tai kopioikaa suoraan tekstikenttäämme.
it: Spiacente, Revita non riesce a estrarre la storia da questa pagina Web. Si prega di copiare il testo dalla pagina Web. Se desideri esercitarti con questa storia, salvala in un file <b>.TXT</b> sul tuo computer e poi carica il file di testo.
ru: К сожалению, Ревита не может извлечь текст из этой веб-страницы. Пожалуйста, скопируйте текст в файл и загрузите в Ревиту, используя кнопки для загрузки файлов.

source: Empty file!
fi: Tyhjä tiedosto!
it: File vuoto!
ru: Пустой файл!

source: Invalid file. Please make sure the file is formatted as text.
fi: Tiedosto väärässä muodossa. Tiedoston laajentamisen pitää olla <b>.txt</b>
it: File non valido. Assicurati che il file contenga solo testo.
ru: Неправильный формат файла. Пожалуйста, загрузите файл в текстовом формате с расширением <b>.txt</b>

source: No such page!
fi: Hakemaasi sivua ei löytynyt!
it: Pagina inesistente!
ru: Несуществующая страница!

source: Go back:
fi: Takaisin:
it: Torna indietro:
ru: Назад:

source: Main page
fi: Pääsivu
it: Pagina principale
ru: Главная страница

source: News
fi: Uutiset
it: Notizie
ru: Новости

source: Dear %(name)s,
fi: Hyvä %(name)s,
it: Ciao, %(name)s,
ru: Здравствуйте, %(name)s!

source: The user %(stranger)s wants to share with you the story: &quot;%(story)s&quot;
fi: Käyttäjä %(stranger)s haluaa jakaa kanssasi tarinan:&quot;%(story)s&quot;
it: L'utente %(stranger)s ha condiviso una storia con te: &quot;%(story)s&quot;
ru: Пользователь %(stranger)s поделился с Вами текстом: &quot;%(story)s&quot;

source: Please click below to accept the story. You can add %(stranger)s as a friend to accept stories s/he will share with you in the future. You can also block %(stranger)s from sending you anything, using the links below:
fi: Ota vastaan tarina allolevaa nappia käyttäen. Voit lisätä %(stranger)s ystäväksi jotta hän voi jakaa kanssasi tarinoita hyväksymättä. Voit myös estää hänet lähettämästä mitään, käyttäen allaolevia linkkejä:
it: Clicca qui sotto per accettare la storia. Puoi aggiungere %(stranger)s agli amici per ricevere automaticamente le storie. Puoi bloccare %(stranger)s cliccando sul link sottostante:
ru: Пожалуйста, нажмите ниже, чтобы получить текст. Вы можете добавить %(stranger)s в список друзей, чтобы автоматически получать истории. Вы можете заблокировать %(stranger)s, пройдя по ссылкам ниже:

source: ACCEPT
fi: HYVÄKSY
it: ACCETTA LA STORIA
ru: ПРИНЯТЬ ТЕКСТ

source: ACCEPT and ADD AS FRIEND
fi: HYVÄKSY JA LISÄÄ YSTÄVÄ
it: ACCETTA la storia e AGGIUNGI AGLI AMICI
ru: ПРИНЯТЬ текст и ДОБАВИТЬ в список друзей

source: BLOCK
fi: ESTÄ
it: BLOCCA
ru: ЗАБЛОКИРОВАТЬ

source: Visit Revita
fi: Revita
it: Accedi a Revita
ru: Войдите в систему Ревита

source: Best regards,
fi: Ystävällisin terveisin,
it: Con i nostri migliori auguri,
ru: С наилучшими пожеланиями,

source: Revita team
fi: Revitan tiimi
it: Il team Revita
ru: Команда проекта Ревита

source: Dear <b><i>%(name)s</i></b>,
fi: Hyvä <b><i>%(name)s</i></b>,
it: Ciao, <b><i>%(name)s</i></b>!
ru: Здравствуйте, <b><i>%(name)s</i></b>!

source: User <b><i>%(stranger)s</i></b> has invited you to group <b><i>%(group_name)s</i></b>.<br/>You can join the group by clicking the link below.<br/>If you wish to leave the group later, please visit your Profile page.
it: L'utente <b><i>%(stranger)s</i></b> ti ha invitato nel gruppo <b><i>%(group_name)s</i></b>.<br/>. <br/> puoi accedere al gruppo cliccando sul link qui sotto. <br/> Se vuoi abbandonare il gruppo, vai sul tuo profilo.
ru: Пользователь <b><i>%(stranger)s</i></b> пригласил Вас в группу <b><i>%(group_name)s</i></b>.<br/>Вы можете вступить в группу, пройдя по ссылке ниже.<br/>Если Вы хотите покинуть группу, пожалуйста, пройдите в Ваш профиль.

source: Welcome to Revita
fi: Tervetuloa Revitaan
it: Benvenuto/a in Revita
ru: Добро пожаловать в систему Ревита

source: Interface language
fi: Käyttöliittymän kieli
it: Lingua dell'interfaccia
ru: Язык интерфейса

source: Tour
fi: Esittely
it: Presentazione
ru: Введение

source: About
fi: Tietoa projektista
it: Su di noi
ru: О нас

source: Score:
fi: Pisteet:
it: Punteggio:
ru: Баллы:

source: See new features
fi: Uudet ominaisuudet
it: Nuove funzioni ⇒
ru: Новые функции в системе ⇒ &nbsp;&nbsp;

source: Learning-language
fi: Oppimis-kieli
it: Lingua studiata
ru: Изучаемый язык

source: Settings
fi: Asetukset
it: Impostazioni
ru: Настройки

source: Learning from stories
fi: Kertomuksista oppiminen
it: Studiamo con le storie
ru: Обучаемся на текстах

source: babel text translations
it: Salvare traduzione

source: Show _MENU_ stories
fi: Näytä: _MENU_ tekstiä
it: Mostra: _MENU_ storie
ru: Показать: _MENU_ текстов

source: No matching stories found
fi: Tekstejä ei vielä ladattu &mdash; lisää oma teksti
it: Ancora nessuna storia inserita—caricare una storia
ru: Текстов еще нет &mdash; пожалуйста, загрузите текст

source: Showing _START_ to _END_ of _TOTAL_ stories
fi: Tekstit _START_&ndash;_END_, yhteensä: _TOTAL_
it: Mostra storie da _START_ a _END_ (delle _TOTAL_ totali)
ru: Тексты от _START_ до _END_ (всего _TOTAL_)

source: No stories available
fi: Ei kertomuksia saatavissa
it: Nessuna storia disponibile
ru: Нет загруженных текстов

source: filtered from _MAX_ total stories
fi: suodatettu _MAX_ tekstistä
it: Da _MAX_ storie
ru: из _MAX_ текстов

source: Search:
fi: Hae:
it: Cerca:
ru: Поиск:

source: Sort by
fi: Järjestä:
it: Ordina per:
ru: Сортировать:

source: Title
fi: Otsikko
it: Titolo
ru: Название

source: Progress
fi: Edistyminen
it: Progressi
ru: Прогресс

source: Difficulty
fi: Taso
it: Difficoltà
ru: Сложность

source: Date added
fi: Ladattu
it: Data
ru: Дата

source: Group
fi: Ryhmä
it: Gruppo
ru: Группа

source: All
it: Tutto

source: University of Helsinki
fi: Helsingin Yliopisto
it: Università di Helsinki
ru: Хельсинкский университет

source: All copyrighted materials used by explicit permission from holder.
fi: Tekijänoikeuden alaista materiaalia käytetään oikeudenhaltijoiden luvalla.
it: I materiali, protetti dal diritto d'autore, vengono usati col permesso del titolare del diritto
ru: Материалы, защищенные авторским правом, используются с разрешения правообладателя.

source: Start over
fi: Aloita alusta
it: Ricominciare
ru: Начать заново

source: Next story
fi: Seuraava kertomus
it: Prossima storia
ru: Следующая история

source: Your account has been created. Please follow the link below to confirm your registration.
fi: Tilisi on luotu. Seuraa alla olevaa linkkiä vahvistaaksesi rekisteröintisi.
it: Il tuo account è stato creato. Clicca sul link sottostante per confermare la registrazione.
ru: Ваш аккаунт создан. Пройдите по ссылке ниже, чтобы подтвердить Вашу регистрацию

source: Thank you for your message. We will get back to you shortly.
fi: Kiitos viestistäsi. Palaamme asiaan pian.
it: Ti ringraziamo per il messaggio. Ti risponderemo il prima possibile
ru: Благодарим за Ваше сообщение. Мы вскоре свяжемся с Вами.

source: Give us feedback
fi: Anna palautetta
it: La tua opinione su Revita
ru: Ваше мнение о Ревите

source: Contact us
fi: Ota meihin yhteyttä
it: Contattaci!
ru: Свяжитесь с нами

source: Name
fi: Nimi
it: Nome
ru: Имя

source: Subject
fi: Otsikko
it: Oggetto
ru: Тема сообщения

source: Your message
fi: Viestisi
it: Messaggio
ru: Ваше сообщение

source: Send
fi: Lähetä
it: Inviare
ru: Отправить

source: Building your crossword
fi: Rakennetaan ristikkoasi
it: Costruendo il tuo cruciverba...
ru: Кроссворд строится...

source: Hint
fi: Vihje
it: Suggerimento
ru: Подсказка

source: Close
fi: Sulje
it: Chiudere
ru: Закрыть

source: You do not have any apples yet.
fi: Ei omenoita
it: Non hai mele ancora
ru: У Вас пока нет яблок

source: Get hint for one apple
fi: Voit vaihtaa omena vihjeeseen
it: Scambiare una mela per un suggerimento
ru: Обменять яблоко на подсказку

source: Congratulations! You have solved this crossword!
fi: Onnittelut! Olet ratkaissut sanaristikon.
it: Complimenti! Hai risolto il cruciverba
ru: Поздравляем, Вы решили кроссворд!

source: You have no apples
fi: Ei omenoita
it: Non hai mele ancora
ru: У Вас пока нет яблок

source: Please log in to access this page.
fi: Kirjaudu sivulle
it: Effettua il login per accedere alla pagina
ru: Пожалуйста войдите в систему, чтобы получить доступ к этой странице

source: Erzya
fi: Ersä
it: Erzo
ru: Эрзянский

source: Komi-Zyrian
fi: Komisyrjääni
it: Sirieno
ru: Коми-зырянский

source: Komi-Permiak
fi: Komipermjakki
it: Permiaco
ru: Коми-пермяцкий

source: Meadow-Mari
fi: Niittymari
it: Mari
ru: Лугово-марийский

source: Mansi
it: Vogulo
ru: Мансийский

source: Udmurt
it: Udmurto
ru: Удмуртский

source: North-Saami
fi: Pohjoissaame
it: Sami settentrionale
ru: Северносаамский

source: Tatar
it: Tartaro

source: Finnish
fi: Suomi
it: Finlandese
ru: Финский

source: German
fi: Saksa
it: Tedesco
ru: Немецкий

source: Russian
fi: Venäjä
it: Russo
ru: Русский

source: Swedish
fi: Ruotsi
it: Svedese
ru: Шведский

source: Spanish
fi: Espanja
it: Spagnolo
ru: Испанский

source: Catalan
fi: Katalaani
it: Catalano
ru: Каталанский

source: French
fi: Ranska
it: Francese
ru: Французский

source: Sakha
fi: Jakuutin kieli
it: Sacha
ru: Саха

source: Kazakh
it: Kazako
ru: Казахский

source: Arabic
fi: Arabia
it: Arabo
ru: Арабский

source: Chinese
fi: Kiina
it: Cinese
ru: Китайский

source: Czech
fi: Tsekki
it: Ceco
ru: Чешский

source: English
fi: Englanti
it: Inglese
ru: Английский

source: Italian
fi: Italia
it: Italiano
ru: Итальянский

source: Japanese
fi: Japani
it: Giapponese
ru: Японский

source: Norwegian
fi: Norja
it: Norvegese
ru: Норвежский

source: Polish
fi: Puola
it: Polacco
ru: Польский

source: Portuguese
fi: Portugali
it: Portoghese
ru: Португальский

source: Turkish
fi: Turkki
it: Turco
ru: Турецкий

source: Translations in English
fi: Käännökset englanniksi
it: Traduzione in inglese
ru: Перевод на английский

source: Translations in Russian
fi: Käännökset venäjäksi
it: Traduzione in russo
ru: Перевод на русский

source: Translations in Finnish
fi: Käännökset suomeksi
it: Traduzione in finlandese
ru: Перевод на финский

source: Paradigm 1
fi: Deklinaatio I
it: I declinazione
ru: I Склонение

source: Paradigm 2
fi: Deklinaatio II
it: II declinazione
ru: II Склонение

source: Paradigm 3
fi: Deklinaatio III
it: III declinazione
ru: III Склонение

source: Paradigm 4
fi: Pluralia Tantum
it: Pluralia Tantum
ru: Pluralia Tantum

source: Paradigm 5
fi: Muut
it: Altri
ru: Разносклоняемые

source: Lexicology. Lexical semantics
fi: Leksikologia. Merkitys.
it: Lessicologia. Significati delle parole
ru: Лексикология. Значения слов

source: Collocations
fi: Kollokaatio.
it: Collocazioni
ru: Коллокации

source: Lexicology. Coordination of words
fi: Leksikologia. 'Yhteyteen sopivuus'.
it: Lessicologia. Combinazione delle parole
ru: Лексикология. Сочетаемость слов

source: Verb. Case government
fi: Verbit. Sijamuoto.
it: Verbo. Reggenza verbale
ru: Глагол. Падежное управление

source: Verb. Prepositional government
fi: Verbit. Prepositio.
it: Verbo. Reggenza preposizionale
ru: Глагол. Предложное управление

source: Adjectives
fi: Adjektiivit.
it: Aggettivi
ru: Прилагательные

source: Nouns
fi: Substantiivit. Rektio. (Существительное. Управление.)
it: Sostantivi
ru: Существительные

source: Impersonal verbs (except verba meteorologica) and their government
fi: Persoonattomat verbit (paitsi luonnonilmiötä osoittavat verbit) ja niiden vaatima rektio.
it: Verbi impersonali (escludendo i verba meteorologica) e la loro reggenza
ru: Безличные глаголы (исключая verba meteorologica) и их управление

source: Predicative adverbs and their government. Existence, state, time
fi: Predikatiiviset adverbit ja niiden vaatima rektio. Olosuhteet, olotila, aika.
it: Avverbi predicativi e la loro reggenza. Esistenza, stato, tempo
ru: Предикативные наречия и их управление. Существование, состояние, время

source: Predicative adverbs and their government. Necessity, possibility, impossibility
fi: Predikatiiviset adverbit ja niiden vaatima rektio. Välttämätön, mahdollinen, mahdoton.
it: Avverbi predicativi e la loro reggenza. Necessità, possibilità, impossibilità
ru: Предикативные наречия и их управление. Необходимость, возможность, невозможность

source: Negative constructions with predicative 'be' (and synonyms), genitive of negation
fi: Predikaattina byt'-verbin (tai sen 'synonyymien') kielteinen rakenne + genetiivi.
it: Costrutti negativi con essere predicativo (ed i suoi sinonimi) e il genitivo di negazione
ru: Отрицательные конструкции с предикативным быть (и его синонимами) и генитив отрицания

source: Sentences with dative subject
fi: Toiminnan suorittajan ilmaiseminen datiivilla.
it: Frasi col soggetto al dativo
ru: Предложения с дативным субъектом

source: Expressions of time, place and manner. Preposition-free expressions
fi: Ajan, paikan ja tavan ilmaiseminen, myös prepositiottomat ilmaukset.
it: Espressioni di tempo, luogo e modalità d'azione. Espressioni senza preposizione
ru: Выражения времени, места и образа действия. Беспредложные выражения

source: Constructions with cardinal numerals
fi: Lukusanojen kanssa käytettävät rakenteet. Perusluvut.
it: Costrutti con i numerali cardinali
ru: Конструкции с количественными числительными

source: Constructions with collective numerals
fi: Lukusanojen kanssa käytettävät rakenteet. Kollektiiviluvut.
it: Costrutti con i numerali collettivi
ru: Конструкции с собирательными числительными

source: Genitive plural of Pluralia tantum words
fi: Pluralia tantumien monikon genetiivi.
it: Genitivo plurale dei Pluralia tantum
ru: Генитив множественного числа слов Pluralia tantum

source: I declension. Type 'музей-музеи, воробей-воробьи'
fi: I deklinaatio. Tyyppi музей (музеи), mutta воробей (воробьи).
it: Prima declinazione. Tipologie 'музей-музеи, воробей-воробьи'
ru: I склонение. Типы 'музей-музеи, воробей-воробьи'

source: I declension. Type 'санаторий'
fi: I deklinaatio. Tyyppi санаторий.
it: Prima declinazione. Tipologia 'санаторий'
ru: I склонение. Тип 'санаторий'

source: I declension. Fleeting vowels and alternations я, е, ё / й ('заяц-зайца, заём-займа')
fi: I deklinaatio. Väistyvät vokaalit + vaihtelu я, е, ё / й (заяц-зайца, заём-займа).
it: Prima declinazione. Vocali fuggevoli e alternazioni я, е, ё / й ('заяц-зайца, заём-займа')
ru: I склонение. Беглые гласные и чередования я, е, ё / й ('заяц-зайца, заём-займа')

source: I declension. Type 'карандаш'
fi: I deklinaatio. Tyyppi карандаш.
it: Prima declinazione. Tipologia 'карандаш'
ru: I склонение. Тип 'карандаш'

source: I declension. Type 'адрес-адреса'
fi: I deklinaatio. Tyyppi адрес-адреса.
it: Prima declinazione. Tipologia 'адрес-адреса'
ru: I склонение. Тип 'адрес-адреса'

source: I declension. Type 'солдат-много солдат, сапог-пара сапог'
fi: I deklinaatio. Tyyppi солдат-много солдат, сапог-пара сапог.
it: Prima declinazione. Tipologia 'солдат-много солдат, сапог-пара сапог'
ru: I склонение. Тип 'солдат-много солдат, сапог-пара сапог'

source: I declension. Type '-анин/-янин, -ин'
fi: I deklinaatio. -анин/-янин, -ин -loppuiset kansallisuutta yms. tark. sanat.
it: Prima declinazione. Tipologia in -анин/-янин, -ин
ru: I склонение. Тип на -анин/-янин, -ин

source: I declension. Type 'дерево-деревья'
fi: I deklinaatio. Tyyppi дерево-деревья.
it: Prima declinazione. Tipologia'дерево-деревья'
ru: I склонение. Тип 'дерево-деревья'

source: II declension. Type 'армия'
fi: II deklinaatio. Tyyppi армия.
it: Seconda declinazione. Tipologia'армия'
ru: II склонение. Тип 'армия'

source: II declension. Type на -ня
fi: II deklinaatio. -ня -loppuiset.
it: Seconda declinazione. Tipologia in -ня
ru: II склонение. Тип на -ня

source: II declension. Type 'статья'
fi: II deklinaatio. Tyyppi статья.
it: Seconda declinazione. Tipologia 'статья'
ru: II склонение. Тип 'статья'

source: Fleeting vowel in genitive plural
fi: Väistyvä vokaali monikon genetiivissä.
it: Vocale fuggevole al caso genitivo plurale
ru: Беглая гласная в родительном падеже мн. ч

source: Nouns with prepositions в/на ending in -у/-ю in prepositional singular
fi: Poikeukselliset (sija)päätteet. Sanat, joiden yksikön prepositionaali в/на + -у(-ю).
it: Sostantivi in -у/-ю al caso prepositivo singolare con preposizioni в/на
ru: Существительные на -у/-ю в предложном падеже ед. ч. с предлогами в/на

source: Nouns ending in -у/-ю in prepositional singular and -а in nominative plural
fi: Poikeukselliset (sija)päätteet. Sanat, joiden yksikön prepositionaali в/на + -у(-ю) ja monikon nominatiivi -а.
it: Sostantivi in -у/-ю al prepositivo singolare e al nominativo plurale
ru: Существительные на -у/-ю в предложном падеже ед. ч. и на -а в именительном падеже мн. ч

source: Possessive adjectives. Type 'лисий'
fi: Possessiiviadjektiivi 'лисий'.
it: Aggettivi possessivi. Tipologia 'лисий'
ru: Притяжательные прилагательные. Тип 'лисий'

source: Ordinal numbers. Type 'третий'
fi: Järjestysluku третий.
it: Numeri ordinali. Tipologia 'третий'
ru: Порядковые числительные. Тип 'третий'

source: Possessive adjectives. Type 'мамин'
fi: Possessiiviadjektiivi tyyppiä 'мамин'.
it: Aggettivi possessivi. Tipologia 'мамин'
ru: Притяжательные прилагательные. Тип 'мамин'

source: Cardinal numbers. 'Сто' vs. 'пятьсот, шестьсот, семьсот, девятьсот'
fi: Lukusanat. Сто vs. пятьсот, шестьсот, семьсот, девятьсот.
it: Numeri cardinali. 'Сто' vs. 'пятьсот, шестьсот, семьсот, девятьсот'
ru: Числительные. 'Сто' vs. 'пятьсот, шестьсот, семьсот, девятьсот'

source: Quantifiers. Collective quantifiers in oblique cases
fi: Lukusanat. Kollektiivilukujen taivutus obliikvisijoissa.
it: Numerali. Declinazione dei numerali collettivi nei casi obliqui
ru: Числительные. Склонение собирательных числительных в косвенных падежах

source: Quantifiers. Collective quantifiers 'оба, обе'
fi: Lukusanat. Kollektiivilukusana оба, обе.
it: Numerali. Numerali collettivi 'оба, обе'
ru: Числительные. Собирательные числительные 'оба, обе'

source: I conjugation. Type 'плакать'
fi: I konjugaatio. Tyyppi плакать (плакаю).
it: Prima coniugazione. Tipologia 'плакать'
ru: I спряжение. Тип 'плакать'

source: I conjugation. Type 'рисовать'
fi: I konjugaatio. Tyyppi рисовать (рисоваю).
it: Prima coniugazione. Tipologia 'рисовать'
ru: I спряжение. Тип 'рисовать'

source: II conjugation. Type 'молчать'
fi: II konjugaatio. Tyyppi молчать (молчаю).
it: Seconda coniugazione. Tipologia 'молчать'
ru: II спряжение. Тип 'молчать'

source: Preterite. Type 'исчезнуть'
fi: Preteriti. Tyyppi исчезнуть (исчезнул).
it: Tempo passato. Tipologia 'исчезнуть'
ru: Прошедшее время. Тип 'исчезнуть'

source: Regular verbs with vowel alternation
fi: Muita verbejä: Standarditaivutukset ja verbit, joissa on konsonanttivaihtelu.
it: Verbi regolari con alternanza consonantica
ru: Правильные глаголы с чередованием согласных

source: Resultative
fi: Perusmerkitykset. Tuloksellisuus - tulos voimassa.
it: Espressione di efficacia, presenza di risultato
ru: Выражение Результативности, наличия результата

source: Iterative / potential iterative / qualities
fi: Perusmerkitykset. Toistuvuus / potentiaallinen toistuvuus / ominaisuus.
it: Espressione di iterazione / iterazione potenziale/ qualità
ru: Выражение итеративности / потенциальной итеративности / качества

source: Expression of duration - 'за какое время'
fi: Perusmerkitykset. Kesto - 'missä ajassa'.
it: Espressione di durata - 'за какое время'
ru: Выражение длительности - 'за какое время'

source: Factual meaning of verbs
fi: Yleisesti toteava.
it: Significato fattuale dei verbi
ru: Обобщенно-фактическое значение глаголов

source: Aspect, expression of action completed in the past
fi: Mitätöityminen.
it: Uso dell'aspetto in frasi che esprimono azioni terminate nel passato
ru: Употребление вида в предложениях, выражающих закончившееся действие в прошлом

source: Aspect, expression of capability/incapability. ('Тебе этого не понимать/понять!')
fi: Kykenevyys.
it: Uso dell'aspetto in frasi che esprimono capacità/incapacità. ('Тебе этого не понимать/понять'!)
ru: Употребление вида в предложениях, выражающих способность /неспособность. ('Тебе этого не понимать/понять'!)

source: Inception of action
fi: 'Ruvetaan'.
it: Espressione di inizio d'azione
ru: Выражение начала действия

source: Negative sentences
fi: Kieltolauseet.
it: Frasi negative
ru: Отрицательные предложения

source: Imperative
fi: Imperatiivi.
it: Imperativo
ru: Императив

source: Proximal future
fi: Lähitulevaisuus.
it: Espressione di futuro imminente
ru: Выражение ближайшего будущего

source: Impersonal sentences. Infinitival sentences. Subordinate sentences ('если / прежде чем' + infinitive)
fi: Persoonattomat lauseet. Infinitiivilauseet. Sivulauseet (если / прежде чем + inf.).
it: Espressioni impersonali. Frasi infinitive.Frasi subordinate ('если / прежде чем' + инфинитив)
ru: Безличные предложения. Инфинитивные предложения. Придаточные предложения ('если / прежде чем' + инфинитив)

source: Impersonal sentences. Infinitival sentences. Modal expressions
fi: Persoonattomat lauseet. Infinitiivilauseet. Modaaliset ilmaukset.
it: Espressioni impersonali. Frasi infinitive. Espressioni modali
ru: Безличные предложения. Инфинитивные предложения. Модальные выражения

source: Impersonal sentences. Infinitival sentences. Sentences, with negative pronouns and adverbs
fi: Persoonattomat lauseet. Infinitiivilauseet. He-alkuisen pronominin tai adverbin sisältävät lauseet.
it: Frasi impersonali. Frasi infinitive. Frasi con pronomi e avverbi negativi
ru: Безличные предложения. Инфинитивные предложения. Предложения, с отрицательными местоимениями и наречиями

source: Generis-personal sentences
fi: Geneeris-persoonaiset lauseet.
it: Frasi personali
ru: Обобщенно-личные предложения

source: Existential sentences (usage of the verb 'быть')
fi: Eksistentiaalilauseet (milloin oikein/luontevaa käyttää est'-muotoa).
it: Frasi esistenziali (uso del verbo 'быть')
ru: Экзистенциальные предложения (употребление глагола 'быть')

source: Passive and its relation to indefinite-personal sentences (equivalent of Finnish impersonal passive)
fi: Passiivilauseet ja niiden suhde indefiniittis-persoonaiseen lausetapaan (suomen passiivin vastineet).
it: Il passivo e la sua relazione alle frasi personali indefinite (equivalenti al passivo indefinito finlandese)
ru: Пассив и его отношение к неопределенно-личным предложениям (эквиваленты финского безличного пассива)

source: Stress: forms of verbal preterite
fi: Verbit: preteriti.
it: Accento: forme del passato dei verbi
ru: Ударение: формы прошедшего времени глаголов

source: Stress: short adjectives
fi: Lyhyet adjektiivit.
it: Accento: aggettivi in forma breve
ru: Ударение: краткие прилагательные

source: Stress: participles
fi: Partisiipit.
it: Accento: forme del participio
ru: Ударение: причастные формы

source: Nouns. Type A: stress on the stem
fi: Substantiivit. Tyyppi A: Paino vartalolla.
it: Sostantivi: Tipologia A: accento sulla base
ru: Существительные. Тип A: ударение на основе

source: Nouns. Type B, B1, B2: stress on the ending
fi: Substantiivit. Tyyppi B, B1, B2: Paino päätteellä.
it: Sostantivi. Tipologia B,B1,B2: accento sula terminazione
ru: Существительные. Тип B, B1, B2: ударение на окончание
