Repository: UniversityOfHelsinkiCS/mobvita
Catalog: client/util/translations/revita/*/LC_MESSAGES/messages.po
Languages: fi, it, ru

source: Send email
fi: Lähetä sähköposti
it: Invia messaggio
ru: Отправить сообщение

source: These should be easy for you!
fi: Nämä pitäisivät olla sinulle helppoja!
it: Questi esercizi sono semplici per te!
ru: Эти упражнения простые для Вас!

source: click to listen
fi: &#x1f5b0; kuunnellaksesi
it: &#x1f5b0; Clicca per ascoltare
ru: &#x1f5b0; прослушать

source: Check Answers
fi: Tarkista
it: Verifica
ru: Проверить

source: Restart story
fi: Aloita alusta
it: Inizia da capo
ru: Начать с начала

source: Game over
fi: Peli ohi
it: Gioco concluso
ru: Игра окончена

source: You won!
fi: Voitit!
it: Hai vinto!
ru: Вы победили!

source: extra apples!
fi: ekstra omeinoita!
it: Mele extra!
ru: дополнительные яблоки!

source: Tie! That was close, try again!
fi: Tasapeli! Se oli lähellä, kokeile uusiksi!
it: Pareggio! Prova ancora!
ru: Ничья! Попробуйте еще раз!

source: You lost..
fi: Hävisit..
it: Hai perso
ru: Вы проиграли...

source: Continue
fi: Jatka
it: Continua
ru: Продолжить

source: %(username)s's profile
fi: %(username)s &mdash; profiili
it: %(username)s — Profilo
ru: %(username)s &mdash; Профиль

source: Achievements
fi: Saavutukset
it: Premi
ru: Призы

source: Groups
fi: Ryhmät
it: Gruppi
ru: Группы

source: Friends
fi: Kaverisi
it: Amici
ru: Друзья

source: Click here to enable Facebook login
fi: Klikkaa tästä ottaaksesi käyttöön Facebook sisäänkirjautumisen
it: Permetti l'accesso tramite Facebook
ru: Разрешить доступ через Facebook

source: You can log in to Revita with your Facebook account
fi: Voit kirjautua sisään Facebook-tililläsi
it: Puoi entrare in Revita tramite Facebook
ru: Вы можете заходить в Ревиту через Facebook

source: Add a friend
fi: Lisää kaverit
it: Aggiungi amici
ru: Добавить друга

source: Add friend
fi: Lisää kaveriksi
it: Aggiungi amico
ru: Добавить друзей

source: Block a user
fi: Estä käyttäjä
it: Blocca utente
ru: Заблокировать пользователя

source: Block
fi: Estä
it: Blocca
ru: Заблокировать

source: Delete group
fi: Poista ryhmä
it: Cancella gruppo
ru: Удалить группу

source: Create new
fi: Luo uusi
it: Crea nuovo gruppo
ru: Создать новую группу

source: Manage group
fi: Hallitse
it: Gestisci il gruppo
ru: Редактировать группу:

source: As teacher
fi: Opettajana
it: Come insegnante
ru: В роли учителя

source: Add person to group
fi: Lisää henkilö ryhmään
it: Aggiungi utente al gruppo
ru: Добавить пользователя в группу

source: Practice time achievements
fi: Harjoitusaikaan liittyvät saavutukset
it: Risultati per le ore di pratica
ru: Призы за количество часов, которые Вы упражнялись

source: Story upload achievements
fi: Kertomuksien lisäämisen saavutukset
it: Risultati per il numero di storie caricate
ru: Призы за количество загруженных историй

source: Story covering achievements
fi: Kertomuksien kattavuuksien saavutukset
it: Risultati per il numero di storie completate
ru: Призы за количество выполненых историй

source: This will remove this user from your friend list, are you sure you want to proceed?
fi: Oletko varma, että haluat poistaa tämän henkilön ystävä listalta?
it: Vuoi davvero eliminare questo utente dalla lista di amici?
ru: Вы уверены, что хотите удалить этого пользователя из списка друзей?

source: This will remove this user from your blocked list, are you sure you want to proceed?
fi: Oletko varma, että haluat poistaa poistaa henkilön esto listalta?
it: Vuoi davvero eliminare questo utente dalla lista dei bloccati?
ru: Вы уверены, что хотите удалить этого пользователя из списка заблокированных?

source: This will remove this user from this group, are you sure you want to proceed?
fi: Oletko varma, että haluat poistaa tämän henkilön ryhmästä?
it: Vuoi davvero eliminare questo utente dal gruppo?
ru: Вы уверены, что хотите удалить этого пользователя из группы?

source: This will remove the group, are you sure you want to proceed?
fi: Oletko varma, että haluat poistaa tämän ryhmän?
it: Vuoi davvero eliminare questo gruppo?
ru: Вы уверены, что хотите удалить эту группу?

source: Delete
fi: Poista
it: Eliminare
ru: Удалить

source: Create new group
fi: Luo uusi ryhmä
it: Creare un nuovo gruppo
ru: Создать новую группу

source: Multiple emails can be separated by space.
fi: Useat osoitteet erotellaan välilyönnillä
it: Si possono inserire vari indirizzi separati dallo spazio
ru: Можно ввести несколько адресов, разделенных пробелами

source: Name of group
fi: Ryhmän nimi
it: Nome del gruppo
ru: Название Группы

source: Teacher emails
fi: Opettajien sähköpostiosoitteet
it: Indirizzo degli insegnanti
ru: Адреса учителей

source: Student emails
fi: Oppilaiden sähköpostiosoitteet
it: Indirizzo degli studenti
ru: Адреса учеников

source: Create
fi: Luo
it: Crea gruppo
ru: Создать группу

source: Create account with <i>any</i> username and valid e-mail
fi: Luo tili millä tahansa sähköpostiosoitteellasi ja käyttäjänimellä
it: Per creare un account inserire l'indirizzo email e <i> qualsiasi<i> nome utente
ru: Чтобы создать аккаунт, введите адрес электронной почты; и <i>любое</i> имя пользователя

source: Revita will send confirmation by e-mail
fi: Revita lähettää sinulle varmistuksen sähköpostitse
it: Revita invierà la conferma di registrazione
ru: Ревита пришлет подтверждение регистрации

source: (After that, you may also log in via Facebook)
fi: (Sen jälkeen voit myös kirjautua sisään Facebookin kautta)
it: In seguito potrai entrare in Revita anche tramite Facebook
ru: (Впоследствии Вы сможете заходить в Ревиту также через Facebook)

source: After that, you may also log in via Facebook
fi: Sen jälkeen voit myös kirjautua sisään Facebookin kautta
it: In seguito potrai entrare in Revita anche tramite Facebook
ru: Впоследствии Вы сможете заходить в Ревиту также через Facebook

source: You have requested to reset your Revita password. Please follow the link below to reset your password.
fi: Pyysit salasanan vaihtoa. Seuraa alla olevaa linkkiä vaihtaaksesi salasanasi.
it: Abbiamo ricevuto la richiesta di aggiornamento password. Segui il link per aggiornarla
ru: Мы получили от Вас запрос об обновлении пароля. Пожалуйста, пройдите по ссылке, чтобы обновить пароль.

source: Practice mode: <br/>Enable exercise types
fi: Tehtävät
it: Tipi di esercizi
ru: Режим "Практика": <br/>Типы упражнений

source: Fill the correct form
fi: Täydennä oikea muoto
it: Riempi lo spazio con la forma adatta
ru: Заполнить пропуск

source: Multiple choice
fi: Monivalinta
it: Possibilità di risposta tra alcune varianti
ru: Выбор ответа из нескольких вариантов

source: Type the word you hear
fi: Kirjoita sanan jonka kuulet
it: Digita la parola che senti
ru: Восприятие на слух

source: Second chance when practicing stories
fi: Uusi yritys harjoitellessa
it: Secondo tentativo
ru: Вторая попытка

source: Flashcards: How many cards per practice session
fi: Kysymyskortit: Kuinka monta korttia per sessio
it: Numero di flashcard per ogni sessione
ru: Количество флеш-карт на каждую сессию

source: Welcome!
fi: Tervetuloa!
it: Benvenuto!
ru: Добро пожаловать!

source: Master a language by learning from stories of your own choosing
fi: Opi hallitsemaan kieli oppimalla valitsemastasi kertomuksistasi
it: Revita aiuta a studiare le lingue grazie a testi di tua scelta
ru: Ревита помогает изучать язык на основе текстов по Вашему выбору

source: Create an account
fi: Luo uusi tiili
it: Crea un account
ru: Создать аккаунт

source: It is free now and forever.
fi: Se on ilmaista nyt ja aina.
it: Revita rimarrà per sempre gratuita.
ru: Revita всегда будет бесплатна

source: Try Revita with our sample stories
fi: Kokeile Revitaa näytekertomuksillamme
it: Prova Revita con le storie selezionate da noi
ru: Демо-версия на основе подобранных нами текстов

source: Register to upload your own stories
fi: Rekisteröidy lisätäksesi omia kertomuksiasi
it: Registrati e carica i tuoi testi
ru: Зарегистрируйтесь и загрузите Ваши тексты

source: Revita is free and will always remain so.
fi: Revita tulee aina olemaan ilmainen.
it: Revita è una risorsa gratuita. Per sempre
ru: Ревита — это бесплатный ресурс. Навсегда.

source: Which language would you like to practice?
fi: Mitä kieltä haluaisit opetella?
it: Quale lingua vuoi studiare?
ru: Какой язык Вы изучаете?

source: You can change this anytime.
fi: Voit vaihtaa tätä milloin tahansa.
it: La scelta della lingua si può cambiare sempre
ru: Выбор языка можно изменить в любое время.

source: Create Account
fi: Luo tiilisi
it: Crea un account
ru: Создать аккаунт

source: Try Revita
fi: Kokeile Revitaa
it: Entra nel sistema Revita
ru: Войдите в систему Ревита

source: Back
fi: Takaisin
it: Indietro
ru: Назад

source: The user %(stranger)s has shared with you the story: &quot;%(story)s&quot;
fi: Käyttäjä %(stranger)s on jakanut kanssasi tarinan: &quot;%(story)s&quot;
it: L'utente %(stranger)s ha condiviso con te la storia: &quot;%(story)s&quot;
ru: Пользователь %(stranger)s поделился с Вами историей: &quot;%(story)s&quot;

source: Currently, anyone can share stories with you automatically. You can modify this in your profile preferences. You can accept stories only from friends, add %(stranger)s as a friend, or block %(stranger)s from sending you anything, using the links below:
fi: Tällä hetkellä kuka tahansa voi jakaa kanssasi tarinan automaattisesti. Voit muokata tätä asetuksissa. Voit vastaanottaa tarinoita vain ystäviltä, lisätä %(stranger)s ystäväksi, tai estää %(stranger)s lähettämästä mitään jatkossa, käyttämällä allaolevia linkkejä:
it: Al momento ogni utente può condividere testi con te. Puoi cambiare questo nel tuo profilo in preferenze. Puoi accettare storie solo da amici, aggiungere %(stranger)s come amico o impedire a %(stranger)s di mandarti qualsiasi cosa usando il link sotto:
ru: На данный момент любой пользователь может поделиться текстами с Вами. Вы можете изменить это в профиле Вашего пользователя Вы можете получать истории только от друзей, добавлять %(stranger)s в список друзей или заблокировать %(stranger)s, используя следующие ссылки:

source: PROFILE
fi: PROFIILI
it: Profilo
ru: Профиль

source: ADD FRIEND
fi: LISÄÄ YSTÄVÄ
it: Aggiungi amico
ru: Добавить друга

source: Unfamiliar word?
fi: Tuntematon sana?
it: Parola sconosciuta?
ru: Незнакомое слово?

source: Click on words near the exercises to explore their meaning...
fi: Klikkaa sinulle tuntemattomia sanoja tekstissä saadaksesi käännöksiä. Nämä sanat lisätään kysymyskortteihisi.
it: Clicca sulle parole sconosciute per ottenerne la traduzione. Le parole si salvano tra le flashcard !
ru: Нажмите мышкой на незнакомое слово, чтобы получить его перевод&nbsp;&nbsp; ⇒ &nbsp;&nbsp;слово сохранится в Ваши флеш-карты!

source: Translate to
fi: Käännä
it: Tradurre in
ru: Перевод на

source: Translation temporarily unavailable, please try again later...
fi: Käännös tilapäisesti poissa käytöstä, yrittäkää myöhemmin uudestaan...
it: La traduzione è temporaneamente non accessibile, riprova più tardi
ru: Перевод временно недоступен, пожалуйста, попробуйте позже...

source: Not accessible
fi: Pääsy evätty
it: Non accessibile
ru: Недоступно

source: No flashcards yet for this story. When you practice a story and click on unfamiliar words, they will be added to your flashcards!
fi: Ei flash-kortteja vielä. Kun luet kertomuksen, klikkaa tuntemattomia sanoja lisätäksesi ne flash-kortteihin!
it: Non ci sono flashcard per questa storia. In "Pratica" clicca sulle parole sconosciute verrano salvate tra le flashcard!
ru: Нет флеш-карт для этой истории. В режиме "Практика" кликните на незнакомое слово, оно будет добавлено в Ваши флеш-карты!

source: No flashcards yet. When you practice a story and click on unfamiliar words, they will be added to your flashcards!
fi: Ei flash-kortteja vielä. Kun luet kertomuksen, klikkaa tuntemattomia sanoja lisätäksesi ne flash-kortteihin!
it: Al momento non ci sono flashcard. Durante la "Pratica" clicca sulle parole sconosciute e verranno salvate tra le flashcard!
ru: Нет флеш-карт. В режиме "Практика" кликните на незнакомое слово, оно будет добавлено в Ваши флеш-карты!

source: No flashcards found for this exercise. When you practice a story and click on unfamiliar words, they will be added to your flashcards!
fi: Ei flash-kortteja vielä. Kun luet kertomuksen, klikkaa tuntemattomia sanoja lisätäksesi ne flash-kortteihin!
it: Non ci sono flashcard per questo esercizio. Durante la "Pratica" clicca sulle parole sconosciute verranno salvate tra le flashcard!
ru: Нет флеш-карт для данного упражнения. В режиме "Практика" кликните на незнакомое слово, оно будет добавлено в Ваши флеш-карты!

source: Submit done
fi: Kortti tallennettu
it: Flashcard salvata
ru: Флеш-карта сохранена

source: This word already had a flashcard: merged.
fi: Tällä sanalla on jo kortti, yhdistetty.
it: Hai già una flashcard per questa parola, le modifiche sono state salvate
ru: У Вас уже есть флеш-карта для этого слова, все Ваши изменения сохранены

source: Login
fi: Kirjaudu
ru: Вход

source: Your registration is completed. You can now log in!
fi: Rekisteröintisi onnistui. Voit nyt kirjautua sivulle!
ru: Регистрация выполнена успешно. Вы можете войти в систему.

source: Category
fi: Kategoria
ru: Раздел

source: Story was uploaded, but cut off at 50000 characters.
ru: Tекст добавлен (не более 50 000 символов).

source: Story uploaded successfully!
fi: Tekstin lisäys onnistui!
ru: Текст успешно добавлен!

source: Please note that the links expire in %(num)d day.
fi: Linkki on voimassa %(num)d päivä.
ru: Ссылки истекают через %(num)d день

source: Revita
ru: Ревита

source: Sign out
fi: Kirjaudu ulos
ru: Выйти

source: Please note that the link expires in %(num)d day.
fi: Linkki on voimassa %(num)d päivä.
ru: Ссылка истекает через %(num)d день

source: Email
fi: Lähetä sähköposti
ru: Электронная почта

source: Mari
ru: Марийский

source: Nanai
ru: Нанайский

source: Hindi
ru: Хинди

source: Swahili
fi: Suahili
ru: Суахили

source: 'Забыть, успеть, удаться' + infinitive
fi: Infinitiivi. Забыть, успеть, удасться +.
ru: 'Забыть, успеть, удаться' + инфинитив

source: 'Уметь, нравиться, любить' etc. + infinitive
fi: Infinitiivi. Уметь, нравиться, любить etc. + verbiluettelo.
ru: 'Уметь, нравиться, любить' и др. + инфинитив

source: 'Пора, скорее' + infinitive
fi: Infinitiivi. Пора, скорее.
ru: 'Пора, скорее' + инфинитив

source: 'Нельзя, невозможно, не могу' + infinitive
fi: Infinitiivi. Нельзя, невозможно, не могу.
ru: 'Нельзя, невозможно, не могу' + инфинитив

source: 'Не' + infinitive
fi: Infinitiivi. Не + infinitiivi.
ru: 'Не' + инфинитив

source: No
fi: Ei
ru: Нет

source: Verbs with partitive case
fi: Verbit partitiivissä
ru: Глаголы в партитивном падеже

source: Verbs with illative case
fi: Verbit illatiivissa
ru: Глаголы и иллатив

source: Library
fi: Valitse teksti
ru: Тексты

source: Sport
fi: Urheilu
ru: Спорт

source: Password
fi: Salasana
ru: Пароль

source: Flashcards
fi: Kysymyskortit
ru: Флеш-карты

source: Sign in
ru: Войти

source: Account
fi: Tili
ru: Аккаунт

source: Save
fi: Tallenna
ru: Сохранить

source: Please note that the link expires in %(num)d hour.
fi: Linkki on voimassa %(num)d tunti.
ru: Ссылка действует %(num)d час.

source: (User shared: AFTER)
fi: lähetti
