Repository: UniversityOfHelsinkiCS/mobvita
Catalog: client/util/translations/revita/*/LC_MESSAGES/messages.po
Languages: fi, it, ru

source: Type word & hit Enter
fi: Korjoita sana ja paina Enter
it: Inserisci la parola e premi Enter
ru: Введите слово и нажмите Enter

source: Hints for this flashcard
fi: Vihjeitä tälle kysymyskortille
it: Suggerimenti
ru: Подсказки

source: Type new hint...
fi: Kirjoita uusi vihje...
it: Inserisci un nuovo suggerimento
ru: Введите новую подсказку...

source: Save the hint
fi: Tallenna vihje
it: Salva l'indizio
ru: Сохранить подсказку

source: Hmm... One more hint?
fi: Hmm... Vielä yksi vihje?
it: Mmm… vuoi un indizio?
ru: Хм... Показать подсказку?

source: New translations
fi: Uusia käännöksiä
it: Nuove traduzioni
ru: Переводы

source: Type new translation...
fi: Kirjoita uusi käännös...
it: Inserisci una nuova traduzione…
ru: Введите новый перевод...

source: Save the translation
fi: Tallenna käännös
it: Salva traduzione
ru: Сохранить перевод

source: Submit flashcard
fi: Tallenna kysymyskortti
it: Salva flashcard
ru: Сохранить флеш-карту

source: Clear flashcard
fi: Tyhjennä kysymyskortti
it: Svuota tutti i campi della flashcard
ru: Очистить все поля флеш-карты

source: Warning
fi: Varoitus
it: Attenzione
ru: Внимание

source: This will permanently remove this flashcard, are you sure you want to proceed?
fi: Haluatko varmasti poistaa kortin?
it: Sei sicuro/a di voler eliminare la flascard?
ru: Вы уверены, что хотите удалить эту карту?

source: Remove
fi: Poista
it: Rimuovi
ru: Удалить

source: Cancel
fi: Peruuta
it: Annulla
ru: Отменить

source: Translations
fi: Käännökset
it: Traduzioni
ru: Переводы

source: Hints
fi: Vihjeitä
it: Suggerimenti
ru: Подсказки

source: Definition
fi: Määritelmä
it: Significato
ru: Значение

source: Confirm
fi: Vahvista
it: Salva
ru: Сохранить

source: Message
fi: Viesti
it: Messaggio
ru: Сообщение

source: Your friend %(friend)s has shared with you the story: &quot;%(story)s&quot;
fi: Ystäväsi %(friend)s on jakanut kanssasi tarinan: &quot;%(story)s&quot;
it: Il tuo amico %(friend)s ha condiviso una storia con te: &quot;%(story)s&quot;
ru: Ваш друг %(friend)s поделился с вами текстом: &quot;%(story)s&quot;

source: Stories from %(friend)s appear automatically in your list of shared stories.<br> If you wish to change this, please click below to either remove %(friend)s from your friend list, or block him/her.
fi: %(friend)s jakamat tarinat ilmestyvät automaattisesti sinulle. Valitse allolevista napeista mikäli haluat lisätä hänet kaveriksi tai estää hänet.
it: Le storie inviate da %(friend)s, verranno aggiunte automaticamente alla tua lista. <br>Se vuoi modificare questa opzione, clicca sul link sottostante per bloccare %(friend)s o per rimuoverlo dagli amici
ru: Тексты, отправленные другом %(friend)s, автоматически добавляются в список Ваших текстов.<br> Если Вы хотите это изменить, пожалуйста, пройдите по ссылкам ниже, чтобы заблокировать %(friend)s или удалить из списка друзей.

source: REMOVE
fi: POISTA
it: RIMUOVI
ru: УДАЛИТЬ

source: Upload stories
fi: Lataa kertomuksia
it: Carica storie
ru: Загрузить истории

source: Upload flashcards
fi: Lataa kysymyskortteja
it: Carica flashcard
ru: Загрузить флешкарты

source: My languages
fi: Kielesi
it: La mia lingua
ru: Мой язык

source: Select types of exercises<br/>to practice
fi: Valitse harjoitustyypit
it: Scegli il tema grammaticale da praticare
ru: Выберите типы упражнений<br/>для практики

source: Home
fi: Etusivu
it: Home page
ru: Главная

source: All flashcards
fi: Kaikki kysymyskortit
it: Tutte le flashcard
ru: Все флеш-карты

source: Tests
fi: Testit
it: Test
ru: Тесты

source: Comprehension
fi: Ymmärrys
it: Comprensione
ru: Понимание

source: Practice a random story with the language of your choice
fi: Harjoittele satunnaista kertomusta valitullasi kielelläsi
it: Esercitati con una storia casuale
ru: Начать практику со случайной историей из общей библиотеки

source: Practice Now
fi: Harjoittele
it: Mettiti alla prova
ru: Практика

source: This feature is coming soon!
fi: Tämä ominaisuus tulee pian!
it: Questa funzionalità arriverà presto!
ru: Эта функция скоро появится!

source: Culture
fi: Kulttuuri
it: Cultura
ru: Культура

source: Politics
fi: Politiikka
it: Politica
ru: Политика

source: Science
fi: Tiede
it: Scienza
ru: Наука

source: No stories to show...
fi: Ei kertomuksia...
it: Nessuna storia da mostrare ...
ru: Тексты отсутствуют...

source: Enter a brief answer.
fi: Syötä lyhyt vastaus.
it: Inserisci una risposta breve
ru: Краткий ответ

source: Check answers
fi: Tarkista vastaukset
it: Verifica le risposte
ru: Проверить

source: Next exercise
fi: Seuraava harjoitus
it: Esercizio successivo
ru: Следующее упражнение

source: User
fi: Käyttäjä
it: Utente
ru: Обучающийся

source: Back to tests
fi: ⇐ &nbsp;&nbsp; Takaisin &nbsp;&nbsp;
it: ⇐ Torna ai test
ru: ⇐ &nbsp;&nbsp; Назад к тестам

source: Create a test template
fi: Luo koepohja &nbsp;&nbsp; ⇒ &nbsp;&nbsp;
it: Crea un modello di test
ru: Шаблон для теста &nbsp;&nbsp; ⇒ &nbsp;&nbsp;

source: *Create_New_Test_Template*
fi: • If you are a teacher of the currently selected group, you can edit the test template of this group. • If you want to create other templates, you can go to Groups in your Profile page and create new groups. • Each group has its own test template. • You cannot edit the template as a student.
it: Se sei un insegnante del gruppo selezionato, puoi modificare il modello di testo di questo gruppo. •Se vuoi creare altri modelli, puoi andare in Gruppi nel tuo profilo e creare nuovi gruppi.. • Ogni gruppo ha il proprio modello . • Non puoi modifcare il modello se sei studente
ru: • If you are a teacher of the currently selected group, you can edit the test template of this group. • If you want to create other templates, you can go to Groups in your Profile page and create new groups. • Each group has its own test template. • You cannot edit the template as a student.

source: Pause Test
fi: Pidä tauko...
it: Metti in pausa
ru: Перерыв

source: Resume Test
fi: Jatka testi
it: Riprendi il test
ru: Возобновить тест

source: Quit Test
fi: Lopeta testi.
it: Esci dal test
ru: Прекратить тест

source: Quitting after this question...
fi: Lopetetaan tämän kysymyksen jälkeen...
it: Abbandonare il test dopo questa domanda…
ru: Тест прекратится после этого вопроса...

source: Pause after you answer this question...
fi: Tauko alkaa tämän kysymyksen jälkeen...
it: La pausa inizierà dopo questa domanda…
ru: Перерыв начнется после этого вопроса...

source: Paused. Click &#9658; to resume...
fi: Tauko.<br/> Klikkaa &#9658; jatkamiseksi...
it: Pausa...<br/>Fai clic su ► per riprendere ...
ru: Перерыв...<br/>Чтобы продолжить, нажмите &#9658;...

source: Practice with your favourite stories to improve your skills!
fi: Harjoittele suosikkikertomuksillasi parantaaksesi taitojasi!
it: Esercitati con le tue storie preferite per migliorare le tue abilità!
ru: Тренируйтесь с интересными вам историями<br/> — улучшайте свои навыки!

source: Start a new test
fi: Uusi koe
it: Inizia un nuovo test
ru: Новый тест

source: *New_Test_Help*
fi: • Press this button to take a test. • The test uses the template of the group you have currently selected. • If you are not in any group, you will receive the default test. • During the test, you have 15 seconds for each question. • You can take breaks by pressing the Pause button. • You can end the test by pressing the Stop button. • Pause or Stop will take effect only AFTER you answer the current question.
it: Premi questo pulsante per fare un test.. • Il test usa il modello del gruppo ora selezionato.. • Se non sei in alcun gruppo, riceverai il test predefinito.. • Durante il test hai 15 secondi per ogni quesito.. • Puoi mettere in pausa premendo il pulsante Pausa.. • Puoi terminare il test premendo il pulsante Stop.. •. Pausa o Stop funzionano solo dopo aver risposto al quesito.
ru: • Press this button to take a test. • The test uses the template of the group you have currently selected. • If you are not in any group, you will receive the default test. • During the test, you have 15 seconds for each question. • You can take breaks by pressing the Pause button. • You can end the test by pressing the Stop button. • Pause or Stop will take effect only AFTER you answer the current question.

source: Show latest history
fi: Viimeisimmät tulokset
it: Mostra gli ultimi risultati
ru: Показать последние результаты

source: Show last completed tests
fi: Suoritetut kokeet
it: Mostra i test completati
ru: Пройденные тесты

source: This will permanently remove these test results, are you sure you want to proceed?
fi: Tämä poistaa nämä koetulokset pysyvästi. Oletko varma?
it: Sicuro/a di voler cancellare i risultati del test?
ru: Вы уверены, что хотите удалить результаты этого теста?

source: Good to see you again!
fi: Hyvä nähdä sinua taas!
it: Felici di rivederti!
ru: Рады видеть Вас снова!

source: Sign in to Revita
fi: Kirjaudu sisään
it: Accedi a Revita
ru: Войти в систему Ревита

source: Email address
fi: Sähköpostiosoite
it: Email
ru: Адрес электронной почты

source: Remember me
fi: Pidä minut kirjautuneena
it: Ricordami
ru: Запомнить меня

source: Forgot password?
fi: Salasana unohtunut?
it: Password dimenticata?
ru: Забыли пароль?

source: Register here!
fi: Rekisteröidy
it: Registrati
ru: Регистрация

source: Pack of flashcards
fi: Kysymyskortti pakka
it: Mazzo di flashcard
ru: Набор флеш-карт

source: (User shared: BEFORE)
it: Dall'utente
ru: От пользователя

source: Read
fi: Lue
it: Lettura
ru: Чтение

source: Practice!
fi: Harjoittele
it: Esercitati!
ru: Практика

source: Compete!
fi: Kilpaile
it: Sfida!
ru: Соревнование

source: Crossword
fi: Sanaristikko
it: Cruciverba
ru: Кроссворд

source: Author
fi: Kirjoittaja
it: Autore
ru: Автор

source: Source
fi: Lähde
it: Fonte
ru: Источник

source: Level
fi: Taso
it: Livello
ru: Уровень

source: Story Rating
fi: Taso
it: Difficoltà
ru: Рейтинг текста

source: Exercises answered correctly
fi: %% Vastattu oikein
it: Esercizi eseguiti correttamente
ru: %% упражнений выполненных правильно

source: Part of story covered
fi: %% Luettu osa
it: La parte della storia che hai completato
ru: Часть истории пройдена

source: Delete story
fi: Poista kertomus
it: Cancellare la storia
ru: Удалить историю

source: Share story with a friend
fi: Jaa kaverin kanssa
it: Condividi la storia con gli amici
ru: Поделиться историей с другом

source: Your friends
fi: Kaverisi
it: I tuoi amici
ru: Ваши друзья

source: Actions
fi: Toiminnot
it: Azioni
ru: Действия

source: Teachers
fi: Opettajat
it: Insegnanti
ru: Учителя

source: Students
fi: Oppilaat
it: Studenti
ru: Ученики

source: Blocked users
fi: Estetyt käyttäjät
it: Utenti bloccati
ru: Заблокированные пользователи

source: Your texts
fi: Minun kertomukseni
it: I miei testi
ru: Мои тексты

source: Try uploading your own texts!
fi: Kokeile ladata omia tekstejäsi!
it: Aggiungi i tuoi testi
ru: Добавьте свои тексты

source: My flashcards
fi: Minun kysymyskortit
it: Le mie flashcard
ru: Мои флеш-карты

source: Shared with me
fi: Minun kanssa jaetut
it: Testi condivisi con me
ru: Тексты, которыми со мной поделились

source: Flashcards shared with me
fi: Minun kanssa jaetut kysymyskortit
it: Flashcard condivise con me
ru: Флеш-карты, которыми со мной поделились

source: Public flashcards
fi: Yhteiset kysymyskortit
it: Flashcard comuni
ru: Общие флеш-карты

source: Public texts
fi: Yhteiset kertomukset
it: Testi comuni
ru: Образцы текстов

source: Share story
fi: Jaa tarina
it: Condividi la storia
ru: Поделиться текстом

source: Please enter the email address of the user you wish to share the story with. To share with multiple users at once, simply leave a space between each entered address.
fi: Olkaa hyvä ja antakaa käyttäjän, jonka kanssa haluatte jakaa tarinan sähköpostin. Jos haluat jakaa monelle käyttäjälle samaan aikaan, jätä vain väli jokaisen osoitteen väliin.
it: Inserisci l'indirizzo di posta elettronica dell'utente, con il quale vuoi condividere la storia. Puoi inserire più indirizzi, purchè separati da uno spazio
ru: Пожалуйста, введите адрес электронной почты пользователя, с которым Вы хотите поделиться этим текстом. Вы можете вставить несколько адресов, разделенных пробелами.

source: Please
it: Per favore,
ru: Пожалуйста,

source: sign in
fi: kirjaudu sivulle
it: Effettua il login
ru: войдите,

source: to share your stories!
fi: jaakaaksesi tarinoita
it: per aggiungere la tua storia
ru: чтобы добавить свои тексты.

source: You can share stories that you upload.
fi: Voit jakaa tarinoita jotka lataat.
it: Puoi condividere la storia che hai caricato
ru: Вы можете поделиться загруженной историей.

source: Don't have an account yet? Please
fi: Ei omaa tiliä? Ole hyvä ja
it: Non hai ancora un account?
ru: У Вас еще нет аккаунта? Пожалуйста,

source: register here&rightarrow;
it: Registrati qui&rightarrow;
ru: зарегистрируйтесь&rightarrow;

source: More
fi: Lisää
it: Ulteriori informazioni
ru: Больше

source: about Revita&rightarrow;
fi: tietoa Revitasta&rightarrow;
it: su Revita&rightarrow;
ru: о Ревите здесь&rightarrow;

source: Registration is free. Your account is used it to keep track of your stories and your progress.
fi: Rekisteröityminen on ilmaista. Tiliäsi käytetään tekstiesi ja edistymisesi seuraamiseksi.
it: La registrazione è gratuita. La creazione dell'account è necessaria per salvare le storie, svolgere esercizi e monitorare i tuoi progressi
ru: Регистрация бесплатна. Создание аккаунта необходимо для сохранения истории выполнения упражнений и отслеживания Вашего прогресса.

source: Use sample stories from our library in "guest" mode,
fi: Löydät myös esimerkkeja teksteistä meidän kirjastostamme
it: Puoi svolgere gli esercizi sui testi della nostra libreria in modalità ospite,
ru: Вы можете выполнять упражнения по текстам из нашей библиотеки в гостевом режиме,

source: without signing in.
fi: "vieraana", ilman kirjautumista.
it: senza registrazione,
ru: без регистрации,

source: (Your progress will not be saved for the next session.)
fi: mutta edistymistäsi ei tallenneta seuraavaa istuntoa varten.
it: i tuoi risultati non verranno salvati per la prossima sessione.
ru: но Ваши результаты не могут быть использованы, когда Вы вернетесь к упражнениям в следующий раз.

source: Enter email address...
fi: Ole hyvä ja syötä sähköpostiosoite...
it: Inserire l'indirizzo di posta elettronica…
ru: Пожалуйста, введите адрес электронной почты...

source: Write a message for the receiver (optional)
fi: Kirjoita viesti vastaanottajalle (valinnanvarainen)
it: Scrivi un messaggio al ricevente(opzionale)
ru: Написать сообщение получателю (опционально)

source: Share
fi: Jaa
it: Condividere
ru: Поделиться

source: This will permanently remove this story from your collection, are you sure you want to proceed?
fi: Oletko varma, että haluat poistaa tekstin?
it: Sei sicuro/a di voler eliminare la seguente storia dalla tua lista?
ru: Вы уверены, что хотите удалить этот текст из списка Ваших текстов?

source: Well Done!
fi: Hyvin tehty!
it: Ben fatto!
ru: У Вас отлично получается!

source: You have now practiced one hour in total, keep up the good work!
fi: Olet nyt harjoitellut yhteensä tunnin, jatka samaan malliin!
it: Ti sei esercitato per un'ora, continua così!
ru: Вы упражнялись в течение одного часа, продолжайте в том же духе!

source: Great Job!
fi: Hyvää työtä!
it: Bel lavoro!
ru: Отличная работа!

source: You practiced
fi: Harjoittelit
it: Ti sei esercitato/a
ru: Вы упражнялись

source: hours last week! Keep it up
fi: tuntia viime viikolla! Jakta samaan malliin!
it: ore durante la scorsa settimana. Continua così!
ru: часов на прошлой неделе! Продолжайте в том же духе!

source: Overall score:
fi: Yleispisteet:
it: Punteggio generale
ru: Общая оценка:

source: Correct answers
fi: Oikeat vastaukset
it: Risposte corrette
ru: Правильные ответы

source: Total answers
fi: Kaikki vastaukset
it: Tutte le risposte
ru: Все ответы

source: Accuracy
fi: Tarkkuus
it: Percentuale di risposte corrette
ru: Процент правильных ответов

source: Correct answers given
fi: Vastauksista oikein
it: Numero di risposte corrette
ru: Количество правильных ответов

source: Total number of answers
fi: Kokonaismäärä vastauksia
it: Numero totale di risposte
ru: Количество всех ответов

source: Percentage of correct answers
fi: Oikeiden vastauksien osuus
it: Percentuale di risposte corrette
ru: Процент правильных ответов

source: Add your stories
fi: Lisää oma kertomuksesi
it: Aggiungi le tue storie
ru: Добавить свои тексты

source: to add your own stories!
fi: lisätäksesi tekstisi
it: per aggiungere le tue storie!
ru: чтобы добавить свои тексты!

source: You can add your own stories from your files, or from any web page.
fi: Voit lisätä omat tekstisi tiedostoistasi tai miltä tahansa web-sivulta.
it: Puoi aggiungere qualsiasi file di testo o pagina web
ru: Вы можете загрузить любой текстовый файл или веб-страницу.

source: Please submit a simple text file containing the story you want to add. We will automatically infer the title. Please submit a story in the currently selected practice language.
fi: Olkaa hyvä ja antakaa teksti, jonka haluatte lisätä -- käyttäkää tiedostoa, jossa on joko pääte .txt tai .docx (.doc ei ole tuettu). Revita valitsee ensimmäisen rivin tarinan otsikoksi.
it: Inserire il nome del file .TXT o .DOCX con il testo. Revita usa la prima riga del testo come titolo
ru: Пожалуйста, введите название файла с текстом. Ревита использует первую строку текста как заголовок.

source: Choose a file:
fi: Valitse tiedosto:
it: Scegliere un file
ru: Выбрать текст из файла:

source: Browse
fi: Selaa
it: Scegliere
ru: Выбрать

source: Submit
fi: Lähetä tiedosto
it: Caricare testo
ru: Загрузить текст

source: Paste the raw text you want to add as a story. We will use the first sentence before an empty line as the title. Please submit a story in the currently selected practice language. Minimum length: 50.
fi: Kopioikaa tähän raaka teksti jonka haluatte lisätä tarinana. Käytämme ensimmäisen lauseen ennen tyhjää riviä otsikkona. Antakaa tarina valitussa opetus kielessänne. Minimi pituus: 50.
it: Inserisci il testo della storia. Revita usa la prima riga come titolo
ru: Пожалуйста введите текст истории. Ревита использует первую строку текста как заголовок.

source: Or paste a text:
fi: Tai liitä teksti:
it: Copia un testo
ru: Вставьте текст:

source: Characters left
fi: Merkkejä jäljellä
it: Caratteri rimasti
ru: Свободных символов

source: Title on first line. Text after an empty line...
fi: Otsikko ensimmäisellä rivillä. Teksti tyhjän rivin jälkeen...
it: Titolo sulla prima riga. Testo dopo una riga vuota
ru: Заголовок на первой строке. Текст после пустой строки...

source: Revita will automatically try to find only the story text from your URL. If the results contain unwanted text, please paste the story manually into the box above. Please submit a story in the correct practice language.
fi: Revita yrittää automaattisesti löytää vain tarinan URL:istasi. Jos tulos sisältää ei toivottua tekstiä, olkaa hyvä ja kopioikaa tarina suoraan yllä olevaan tekstikenttään. Antakaa tarina opetus kielessä.
it: Revita tenterà di estrarre il testo dalla tua pagina web. Se il risultato non sarà ben riuscito, copialo manualmente e incollalo nel campo per il caricamento dei file (in alto)
ru: Ревита попытается извлечь текст из Вашей веб-страницы. Если результат будет неудачным, пожалуйста, скопируйте текст вручную и вставьте в поле для загрузки файлов (выше)

source: Or use a web page:
fi: Tai lataa teksti verkkosivusta:
it: O inserisci l'indirizzo della pagina web con il testo d'interesse
ru: Или введите адрес веб-страницы с интересующим Вас текстом:

source: Enter web address...
fi: Ole hyvä ja syötä verkkosivun osoite...
it: Inserisci l'indirizzo della pagina web
ru: Пожалуйста, вставьте адрес веб-страницы...

source: You can visit the following websites to find more stories:
fi: Voit käydä seuraavilla sivustoilla hakemassa lisää kertomuksia:
it: Puoi trovare altre storie nei seguenti siti web
ru: Вы можете найти больше историй на следующих веб-сайтах:

source: Add your own flashcards
fi: Lisää omat kysymyskorttisi
it: Aggiungi la tua flash card
ru: Добавьте свои флеш-карты

source: to add your own flashcards!
fi: lisätäksesi omat kysymyskorttisi!
it: Per aggiungere le tue flashcard
ru: чтобы добавить свои флеш-карты

source: You can add your own flashcards from your files.
fi: Voit lisätä omat kysymyskorttisi tiedostoistasi.
it: Puoi aggiungere le tue flashcard dai tuoi file
ru: Вы можете загрузить свои флеш-карты из файла.

source: Please submit your custom flashcard pack in a txt-format as a .txt file. Use tab as the delimeter. You can find an example file of the format here:
fi: Ystävällisesti anna oman kysymyskorttipakkasi .txt tiedostona. Käytä sarkainta välimerkkinä. Löydät esimerkkitiedoston formaatista täältä:
it: Carica le tue flashcard in formato txt come un file .txt. Usa la tabella come delimitatore. Puoi trovare un file esempio del formato qui:
ru: Загрузите Ваши флеш-карты в формате txt из .txt файла. Предлагаем пример формата здесь:

source: Language in
fi: Kieli
it: Lingua di input
ru: Исходный язык

source: Translation target language
fi: Käännöksen kieli
it: Lingua di traduzione
ru: Язык перевода

source: Customize your exercises
fi: Valitse harjoitustyypit
it: Scegli i temi da praticare
ru: Выберите упражнения для практики

source: Select/Unselect all
fi: Valitse kaikki
it: Scegli tutti
ru: Включить все

source: Place stress inside a word
fi: Aseta stressi sanan sisälle
it: Metti l'accento all'interno della parola
ru: Пост<b>а́</b>вь удар<b>е́</b>ние в слов<b>а́</b>х

source: Enter the word you hear
fi: Kirjoita sanan jonka kuulet
it: Digita la parola che senti
ru: Восприятие на слух

source: Noun declension
fi: Substantiivi
it: Sostantivo
ru: Существительные

source: Noun and adjective declension
fi: Substantiivi ja adjektiivi
it: Declinazione di sostantivo e aggettivo
ru: Существительные и прилагательные

source: Adjective declension
fi: Adjektiivi
it: Aggettivo
ru: Прилагательные

source: Verb aspect
fi: Verbin aspekti
it: Aspetto dei verbi
ru: Вид глагола

source: Participle exercises
fi: Partisiippi
it: Participio
ru: Причастия

source: Easier participle exercises (from participle base)
fi: Helpommat partisiippiharjoitukset
it: Esercizi più semplici (base participiale)
ru: Легкие упражнения (от причастной основы)

source: Harder participle exercises (from verb base)
fi: Vaikeammat partisiippiharjoitukset
it: Esercizi più difficili (base verbale)
ru: Сложные упражнения (от глагольной основы)

source: Prepositions, Postpostion & Adverbs
fi: Prepositio, Postpositio, Adverbi
it: Preposizione, Postposizione, Avverbio
ru: Предлоги/Послелоги, Наречия

source: Prepositions & Adverbs
fi: Prepositio, Adverbi
it: Preposizione, Avverbio
ru: Предлоги, Наречия

source: Prepositions & Postpostion
fi: Prepositio, Postpositio
it: Preposizione, Postposizione
ru: Предлоги, Послелоги

source: Prepositions
fi: Prepositio
it: Preposizione
ru: Предлоги

source: Case
fi: Sijamuoto
it: Caso
ru: Падеж

source: Nominative
fi: Nominatiivi
it: Nominativo
ru: Именительный

source: Genitive
fi: Genetiivi
it: Genitivo
ru: Родительный

source: Dative
fi: Datiivi
it: Dativo
ru: Дательный

source: Accusative
fi: Akkusatiivi
it: Accusativo
ru: Винительный

source: Instrumental
fi: Instruktiivi
it: Strumentale
ru: Творительный

source: Locative
fi: Lokatiivi
it: Locativo
ru: Предложный

source: Number
fi: Luku
it: Numero
ru: Число

source: Singular
fi: Yksikkö
it: Singolare
ru: Единственное число

source: Plural
fi: Monikko
it: Plurale
ru: Множественное число

source: Paradigm
fi: Deklinaatio
it: Declinazione
ru: Склонение

source: Confirm password
fi: Vahvista salasana
it: Conferma la password
ru: Подтвердить пароль

source: Change password
fi: Vaihda salasana
it: Cambia la password
ru: Поменять пароль
