Repository: UniversityOfHelsinkiCS/mobvita
Catalog: client/util/translations/revita/*/LC_MESSAGES/messages.po
Languages: fi, it, ru

source: Choose the best fitting word or expression.
fi: Valitse yhteyteen sopiva sana tai ilmaisu.
it: Scegli la parola o l'espressione adeguata
ru: Выберите подходящее слово или выражение.

source: Fill in the blank.
fi: Täytä tyhjä kohta.
it: Riempi lo spazio con la forma adatta
ru: Заполните пропуск.

source: Answer 10 or more questions to receive feedback
fi: Vastaa 10 tai useampaan kysymykseen saadaksesi palautetta
it: Rispondi ad un minimo di 10 domande per ricevere i risultati
ru: Ответьте минимум на 10 вопросов, чтобы получить результат

source: name
fi: nimi
it: Nome
ru: имя

source: Your registration is not confirmed yet. Please follow the instructions sent to you by email!
fi: Rekisteröintisi ei vielä ole vahvistettu. Seuraa sähköpostitse lähetettyjä ohjeita!
it: La tua registrazione non è stata ancora confermata. Per confermare segui le istruzioni che ti sono state mandate via mail
ru: Ваша регистрация еще не подтверждена. Пожалуйста, ознакомьтесь с инструкциями, отправленными Вам по электронной почте.

source: There is already a user account associated with this email address.
fi: Tähän sähköpostiin liittynyt käyttäjärunnus on jo olemassa.
it: Esiste già un utente registrato con questo indirizzo
ru: Пользователь с таким адресом уже существует.

source: No translation available
fi: Käännöstä ei löydy
it: Traduzione non trovata
ru: Перевод не найден

source: Cannot translate into same language.<br/>Please choose another translation language.
fi: Ei voi kääntää samalle kielelle </br>Ystävällisesti valitkaa toinen käännöskieli
it: Non è possibile tradurre verso la stessa lingua! <br/>Selezionare un'altra lingua di traduzione.
ru: Выберите другой язык перевода.

source: You have to login/register to use flashcards.
fi: Sinun tulee olla kirjautunut / rekisteröitynyt mikäli haluat käyttää kysymyskortteja.
it: Entra o registrati per usare le flashcard
ru: Войдите или зарегистрируйтесь, чтобы использовать флеш-карты.

source: Register
fi: Rekisteröidy
it: Registrazione
ru: Регистрация

source: Submit failed
fi: Tallennus epäonnistui.
it: Flashcard non salvata
ru: Флеш-карта не сохранена

source: Update done
fi: Päivitys valmis
it: Aggiornamento completato
ru: Обновление завершено

source: Update failed
fi: Päivitys epäonnistui
it: Aggiornamento non riuscito
ru: Не удалось обновить

source: This field cannot be empty!
fi: Tämä kenttä ei voi olla tyhjä!
it: Questo campo non può rimanere vuoto
ru: Это поле не должно быть пустым!

source: Please enter a valid email address!
fi: Ole hyvä ja syötä toimiva sähköpostiosoite!
it: Inserire un indirizzo email valido!
ru: Пожалуйста, введите адрес электронной почты

source: Passwords do not match!
fi: Salasanat eivät täsmää!
it: Le password non corrispondono!
ru: Введенные пароли не совпадают!

source: Username
fi: Käyttäjänimi
it: Nome utente
ru: Имя пользователя

source: Current password
fi: Nykyinen salasana
it: Immetti la password corrente
ru: Текущий пароль

source: New password
fi: Uusi salasana
it: Nuova password
ru: Новый пароль

source: Repeat password
fi: Toista uusi salasana
it: Reinserire la password
ru: Повторить пароль

source: Accept stories (from)
fi: Hyväksyn tekstit
it: Accetto i testi inviati
ru: Принимаю тексты

source: (from) Everyone
fi: kaikilta
it: Da tutti
ru: От всех

source: (from) Friends only
fi: vain kavereiltani
it: Solo dagli amici
ru: Только от друзей

source: Please enter your name.
fi: Syötä nimi
it: Inserisci il tuo nome
ru: Введите Ваше имя.

source: Please enter your email address.
fi: Ole hyvä ja syötä toimiva sähköpostiosoite!
it: Inserisci il tuo indirizzo email.
ru: Пожалуйста, введите адрес электронной почты.

source: Please enter your email address!
fi: Ole hyvä ja syötä toimiva sähköpostiosoite!
it: Inserisci il tuo indirizzo email!
ru: Пожалуйста, введите адрес электронной почты!

source: Please enter a subject.
fi: Syötä otsikko
it: Inserisci l'oggetto.
ru: Укажите тему сообщения.

source: Please enter a message.
fi: Ole hyvä ja syötä viesti.
it: Inserisci il testo del messaggio
ru: Пожалуйста, введите текст сообщения.

source: Your message is too short.
fi: Viestisi on liian lyhyt.
it: Il tuo messaggio è troppo corto.
ru: Ваше сообщение слишком короткое.

source: Your message is too long.
fi: Viestisi on liian pitkä.
it: Il tuo messaggio è troppo lungo.
ru: Ваше сообщение слишком длинное.

source: Please enter address of a web page
fi: Ole hyvä ja syötä toimiva nettiosoite!
it: Inserisci l'indirizzo di una pagina web.
ru: Пожалуйста, укажите адрес веб-страницы.

source: This text is too short. Minimum: 50 characters.
fi: Tämä teksti on liian lyhyt. Minimi: 50 merkkiä.
it: Il testo è troppo corto. Minimo: 50 caratteri.
ru: Текст слишком короткий. Минимум: 50 букв.

source: This text is too long. Maximum: 50000 characters.
fi: Tämä teksti on liian pitkä. Maximi: 50000 merkkiä.
it: Il testo è troppo lungo. Massimo: 50 000 caratteri.
ru: Текст слишком длинный. Максимум: 50000 букв.

source: Please enter a valid email.
fi: Ole hyvä ja syötä toimiva sähköpostiosoite!
it: Inserisci un indirizzo email.
ru: Пожалуйста, введите адрес электронной почты.

source: Hours practiced
it: Ore di allenamento

source: Stories uploaded
it: Storie caricate

source: Stories practiced
it: Storie su cui ti sei allenato

source: You used
fi: Sinä käytit
it: Hai usato
ru: Вы использовали

source: Try again!
fi: Yritä uudelleen!
it: Riprova!
ru: Попробуй ещё раз!

source: part of speech
it: un'altra parte del discorso

source: type of adjective
it: un altro tipo di aggettivo

source: type of adverb
it: un altro tipo di avverbio

source: case
it: un altro caso

source: conjugation form
it: un'altra coniugazione

source: gender
it: un altro genere

source: type of gerund
it: un altro tipo di gerundio

source: modal particle
it: un'altra particelun'altra modale

source: mood
it: un altro modo

source: number
it: un altro numero

source: type of participle
it: un altro tipo di participio

source: person
it: un'altra persona

source: possessive suffix
it: un altro suffisso possessivo

source: tense
it: un altro tempo

source: type of verbal adjective
it: un altro tipo di aggettivo verbale

source: type of verbal adverb
it: un altro tipo di avverbio verbale

source: Use
it: Usa

source: voice
it: un'altra diàtesi

source: particle ending
it: un altro suffisso

source: nominative case
it: nominativo

source: genitive case
it: genitivo

source: dative case
it: dativo

source: accusative case
it: accusativo

source: instrumental case
it: strumentale

source: locative case
it: locativo

source: partitive case
it: partitivo

source: inessive case
it: inessivo

source: adessive case
it: adessivo

source: illative case
it: illativo

source: allative case
it: allativo

source: elative case
it: elativo

source: ablative case
it: ablativo

source: abessive case
it: abessivo

source: lative case
it: lativo

source: traslative case
it: traslativo

source: essive case
it: essivo

source: comitative case
it: comitativo

source: positive adjective
it: aggettivo positivo

source: comparative adjective
it: aggettivo comparativo

source: superlative adjective
it: aggettivo superlativo

source: the short adjective
it: aggettivo corto

source: the full adjective
it: aggettivo pieno

source: masculine
it: maschile

source: feminine
it: femminile

source: neuter
it: neutro

source: an infinitive
it: l'infinitivo

source: the indicative
it: l'indicativo

source: the imperative
it: l'imperativo

source: a participle
it: un participio

source: the transgressive
it: il trasgressivo

source: the A-Infinitive (1st)
it: A-infinitivo (primo)

source: the E-Infinitive (2nd)
it: E-infinitivo (secondo)

source: the Ma-Infinitive (3rd)
it: Ma-infinitivo (terzo)

source: the Minen-Infinitive (4th)
it: Minen-infinitivo (quarto)

source: the 5th Infinitive
it: 5-infinitivo

source: conditional mood
it: condizionale

source: potential mood
it: potenziale

source: the passive (impersonal)
it: il passivo

source: present tense
it: presente

source: past tense
it: passato

source: future tense
it: futuro

source: imperfect tense
it: imperfetto

source: perfect tense
it: perfetto

source: pluperfect tense
it: pluperfetto

source: 1st person
it: 1 persona

source: 2nd person
it: 2 persona

source: 3rd person
it: 3 persona

source: Follow the hint
it: Controlla l'indizio

source: Vowel harmony broken
it: Amonia vocale rotta

source: See
fi: Katso
it: Guarda
ru: Смотри

source: and
fi: ja
it: e
ru: и

source: Friend successfully removed
fi: Ystävä poistettu
it: Utente rimosso dagli amici.
ru: Пользователь удален из списка друзей.

source: You have no friends.
fi: Ei kavereita
it: La lista degli amici è vuota
ru: Список Ваших друзей пуст.

source: Teacher successfully removed from group
fi: Opettaja poistettu
it: L'insegnante è stato rimosso dal gruppo
ru: Учитель удален из группы

source: Student successfully removed from group
fi: Oppilas poistettu
it: L'alunno/a è stato/a rimosso/a dal gruppo
ru: Ученик удален из группы

source: Block successfully removed
fi: Esto poistettu
it: L'utente è stato sbloccato correttamente
ru: Пользователь удален из черного списка.

source: You have no blocked users.
fi: Et ole estänyt ketään.
it: Non ci sono utenti bloccati.
ru: Ваш черный список пуст.

source: Token has expired!
fi: Pyyntö on vanhentunut!
it: Richiesta scaduta
ru: Срок запроса истек!

source: You have blocked this user. Please unblock him/her if you wish to add them as a friend.
fi: Olet estänyt tämän käyttäjän. Poista esto mikäli haluat lisätä hänet.
it: L'utente risulta bloccato. Sbloccarlo per inserirlo tra gli amici
ru: Этот пользователь заблокирован. Пожалуйста удалите его из черного списка, прежде чем добавить его в друзья.

source: This user is already your friend
fi: Tämä käyttäjä on jo ystäväsi
it: L'utente è già nella lista degli amici
ru: Этот пользователь уже есть в списке Ваших друзей.

source: You cannot add yourself.
fi: Et voi lisätä itseäsi.
it: Non puoi aggiungere te stesso alla lista degli amici
ru: Вы не можете добавить себя в список друзей.

source: Successfully added friend
fi: Ystävä lisätty
it: Amico aggiunto con successo
ru: Друг успешно добавлен.

source: The account you tried to add has been deleted!
fi: Tämän käyttäjän tili oli poistettu!
it: L'account è stato eliminato
ru: Этот аккаунт был удален!

source: Could not find the story you are trying to accept
fi: Tarinaa ei löytynyt
it: Storia non trovata
ru: Текст, который Вы пытались добавить, не найден.

source: Could not add the flashcards you are trying to accept
fi: Kysymyskortteja ei löytynyt
it: Flashcard non trovata
ru: Флеш-карты, которые Вы пытались добавить, не найдены.

source: This user is not your friend
fi: Tämä käyttäjä ei ole ystäväsi
it: Utente non presente nella lista degli amici
ru: Этого пользователя нет в списке Ваших друзей.

source: This user is already blocked.
fi: Tämä käyttäjä on jo estetty
it: Utente già bloccato
ru: Этот пользователь уже заблокирован.

source: Successfully blocked person
fi: Käyttäjä estetty
it: Utente bloccato
ru: Пользователь заблокирован.

source: Could not find the story you are trying to delete
fi: Tarinaa ei löytynyt
it: La storia che stai tentando di eliminare non è stata trovata
ru: Текст, который Вы пытались удалить, не найден.

source: Could not delete the flashcards
fi: Korttien poistaminen epäonnistui
it: Le flashcard che stai tentando di eliminare non sono state trovate
ru: Флеш-карты, которые Вы пытались удалить, не найдены.

source: An error occurred while deleting the story!
fi: Tekstin poistaminen epäonnistui.
it: Si è verificato un errore durante l'eliminazione della storia
ru: При удалении текста произошла ошибка!

source: Story was successfully removed from personal collection!
fi: Tarina poistettu!
it: Storia eliminata dalla raccolta personale
ru: Текст удален из личной коллекции.

source: Story was removed successfully!
fi: Tekstin poistaminen onnistui!
it: Storia eliminata correttamente!
ru: Текст удален успешно!

source: Story was unshared successfully!
fi: Tarina poistettu
it: Storia eliminata dalla raccolta-testi comune
ru: Текст удален из списка общих текстов.

source: An error occurred while unsharing the story!
fi: Tapahtui virhe tarinaa poistaessa
it: Si è verificato un errore durante l'eliminazione della storia
ru: При удалении текста произошла ошибка!

source: has blocked you.
it: Ti ha bloccato/a
ru: заблокировал(а) Вас.

source: Story already shared with
fi: Tarina on jo jaettu käyttäjälle
it: Hai già condiviso la storia con
ru: Вы уже поделились этим текстом с

source: is already the owner of the story.
it: è un proprietario di questa storia
ru: уже имеет доступ к этому тексту.

source: Story shared and awaiting approval
fi: Tarina jaettu ja odottaa hyväksymistä
it: La storia che hai condiviso è in attesa di approvazione
ru: Текст, которым Вы поделились, ожидает подтверждения

source: Revita - Story shared with you
fi: Revita - Tarina jaettu kanssasi
it: Revita- la storia è stata condivisa con te
ru: Revita &mdash; с Вами поделились текстом

source: Revita - Story awaiting approval
fi: Revita - Tarina odottaa hyväksymistä
it: Revita- la storia è in attesa di approvazione
ru: Ревита - текст ожидает подтверждения

source: Could not find the story you are trying to share
fi: Tarinaa ei löytynyt
it: La storia che stai provando a condividere non è stata trovata
ru: Текст, которым Вы хотели поделиться, не найден

source: Could not add flashcards to the other user
fi: Korttien jakaminen epäonnistui
it: Non è stato possibile inviare le flashcard all'utente
ru: Не удалось отправить флеш-карты другому пользователю

source: Story shared with
fi: Tarina jaettu käyttäjälle
it: Storia condivisa con
ru: Вы поделились текстом с

source: You are trying to share a story with yourself...
fi: Yritit jakaa tarinan itsesi kanssa...
it: Non puoi condividere la storia con te stesso
ru: Вы не можете поделиться текстами с собой...

source: No registered user with e-mail
fi: Ei käyttäjää sähköpostilla
it: Non è stato trovato un utente registrato con questa mail
ru: Пользователь с таким адресом не зарегистрирован

source: Translations in
it: Tradurre in
ru: Перевод на

source: Your group
fi: Sinun ryhmäsi
it: Il tuo gruppo
ru: Ваша группа

source: About Revita
fi: Tietoa Revitasta
it: A proposito di Revita
ru: О проекте Ревита

source: Help
fi: Ohje
it: Aiuto
ru: Помощь

source: Contact
fi: Ota yhteyttä
it: Contatti
ru: Контакт

source: Invalid username and/or password.
fi: Väärä käyttäjätunnus tai salasana
it: Username e / o password non validi.
ru: Неправильный адрес электронной почты или пароль.

source: Sign In
fi: Kirjaudu
it: Accedi
ru: Вход

source: Logged out!
fi: Olet kirjautunut ulos
it: Hai effettuato il log out.
ru: Вы вышли из системы.

source: Email address already exists!
fi: Sähköposti on jo olemassa!
it: L'indirizzo email è già registrato!
ru: Этот адрес электронной почты уже зарегистрирован.

source: Revita - Confirm your registration
fi: Revita - Vahvista rekisteröintisi
it: Revita - Conferma la tua registrazione
ru: Ревита - Пожалуйста, подтвердите Вашу регистрацию

source: Account created. You can now sign in with your Facebook account to Revita.
fi: Tili luotu. Voit nyt kirjautua sisään Facebook-tililläsi.
it: Account creato. Ora puoi accedere a Revita tramite Facebook
ru: Ваш аккаунт создан. Теперь Вы можете заходить в Ревиту через Facebook.

source: A message containing a link to confirm your registration has been sent to your email address. Please follow the instructions there to complete your registration!
fi: Lähetimme sinulle rekisteröinnin vahvisamisen ohjeiden sisältävän viestin sähköpostitse. Ole hyvä ja seuraa vahvistamisen ohjeet.
it: È stata inviata una mail contenente le istruzioni necessarie per completare la registrazione
ru: Вы получите сообщение по электронной почте с инструкциями, как подтвердить Вашу регистрацию.

source: There was a problem with the registration. Please try agin!
fi: Rekisteröinti epäonnistui. Yritä uudelleen.
it: Si è verificato un problema durante la registrazione. Riprova più tardi
ru: Процесс регистрации прерван. Пожалуйста, попробуйте зарегистрироваться заново.

source: Invalid password. Please choose a password that is at least 6 characters long.
fi: Virheellinen salasana. Valitse vähintään 6 kirjainta sisältävä salasana.
it: Password non valida. La password deve contenere almeno 6 caratteri.
ru: Слишком короткий пароль: пароль должен содержать как минимум 6 символов

source: Revita - Reset your password
fi: Revita - Vaihda salasana
it: Revita - Reimposta la tua password
ru: Ревита - Обновите ваш пароль

source: There was a problem with the request. Please try agin!
fi: Pyyntösi epäonnistui. Yritä uudelleen.
it: La richiesta non può essere portata a termine. Riprovare
ru: Ваш запрос не удалось обработать. Пожалуйста, попробуйте снова.

source: An email has been sent to your address. Please follow the instructions there to reset your password.
fi: Viesti on lähetetty sinun sähköpostiosoitteeseesi. Seuraa siinä olevia ohjeita vaihtaaksesi salasanasi.
it: Una mail contenente le istruzioni per resettare la password è stata inviata alla tua mail
ru: Сообщение с инструкцией, как поменять пароль, отправлено по электронной почте.

source: Reset password
fi: Vaihda salasana
it: Reimpostare la password
ru: Обновить пароль

source: Token has expired. You can request to reset your password again!
fi: Pyyntösi on vanhentunut. Voit pyytää salasanasi vaihtamista uudelleen!
it: La richiesta è scaduta. Invia una nuova richiesta per poter cambiare la password
ru: Срок запроса истёк. Пожалуйста, отправьте новый запрос, чтобы поменять пароль.

source: Your password is reset. You can now log in!
fi: Salasanasi on vaihdettu. Voit kirjautua sivulle!
it: Password resettata. Ora puoi accedere al sistema
ru: Ваш пароль обновлен. Вы можете войти в систему.

source: There was a problem resetting your password!
fi: Salasanan vaihtaminen epäonnistui!
it: Si è verificato un problema: la password non è stata resettata
ru: Процесс обновления пароля прерван.

source: Create new password
fi: Luo uusi salasana
it: Inserire una nuova password
ru: Введите новый пароль

source: Group by this name already exists
fi: Samanniminen ryhmä on jo olemassa
it: Il nome scelto per il gruppo è gia in uso, sceglierne un altro:
ru: Группа с таким названием уже существует:

source: Added to the group
fi: Lisätty ryhmään
it: Aggiunto/a al gruppo
ru: Добавлен в группу

source: Invitation sent
fi: Kutsu lähetetty
it: L'invito è stato inviato
ru: Приглашение выслано

source: Not found in the system
fi: Ei löytynyt
it: Non trovato nel sistema
ru: Не найден в системе

source: None of the student emails have a registered user
fi: Millään annetuilla oppilaiden sähköposteilla on käyttäjää
it: Gli indirizzi email degli studenti non sono registrati nel sistema
ru: Адреса учеников не зарегистрированы в системе

source: Group created!
fi: Ryhmä on luotu!
it: Gruppo è stato creato
ru: Группа создана!

source: Detail information
fi: Tietoja
it: Informazioni
ru: Информация

source: User already is a student in this group!
fi: Käyttäjä on jo oppilas tässä ryhmässä!
it: Questo utente fa già parte del gruppo!
ru: Этот ученик уже принадлежит к этой группе!

source: Successfully added student, waiting for confirmation
fi: Oppilas lisätty, odotetaan suostumusta.
it: Alunno aggiunto al gruppo! In attesa di approvazione
ru: Ученик добавлен в группу! Ожидаем подтверждения

source: Successfully added student!
fi: Oppilas lisätty!
it: Alunno aggiunto al gruppo!
ru: Ученик добавлен в группу!

source: User already in teacher in this group!
fi: Käyttäjä on jo opettaja tässä ryhmässä!
it: Questo insegnante fa già parte del gruppo!
ru: Этот учитель уже принадлежит к этой группе!

source: Successfully added teacher
fi: Opettaja lisätty
it: Insegnante aggiunto al gruppo!
ru: Учитель добавлен в группу!

source: You cannot block yourself.
fi: Et voi estää itseäsi.
it: Non puoi bloccare te stesso
ru: Вы не можете заблокировать своего пользователя.

source: Incorrect password.
fi: Väärä salasana
it: Password errata.
ru: Неверный пароль.

source: Incorrect password
fi: Väärä salasana
it: Password errata
ru: Неверный пароль

source: Data saved!
fi: Tiedot tallennettu!
it: Dati salvati!
ru: Данные сохранены!

source: Profile
fi: Profiili
it: Profilo
ru: Профиль

source: Revita - You have been added to a group
fi: Revita - Sinut on lisätty ryhmään
it: Revita- Sei stato/a aggiunto/a al gruppo
ru: Ревита - Вы добавлены в группу

source: answer
fi: vastaus
it: Risposta
ru: ответ

source: phrase
fi: lauseke
it: Frase
ru: фраза

source: Total
fi: Yhteensä
it: Totale
ru: Всего

source: Correct
fi: Oikein
it: Corretto
ru: Правильно

source: Answered
fi: Vastattu
it: Completato
ru: Выполнено

source: Correct answers|||Total answers|||Required to answer|||Not practiced
fi: Oikeat vastaukset|||Kaikki vastaukset|||Pakolliset|||Ei harjoiteltu
it: Risposte corrette|||Totale delle risposte|||Numero di domande a cui rispondere|||Non superato
ru: Правильные ответы|||Всего ответов|||Необходимое количество вопросов|||Не пройдено

source: The uploaded file is too large. Maximum file size is %(num)d KiloBytes.
fi: Tiedosto liian suuri. Tiedoston enimmäiskoko on %(num)d Kt.
it: Il file caricato è troppo grande. La dimensione massima del file è %(num)d KiloByte.
ru: Размер файла превышает максимальный (%(num)d килобайтов).

source: This Web page cannot be extracted!<br/> Please paste the text into the textbox for uploads;<br/> or paste the text into a file and upload the file.
fi: Valittua sivua ei voi ladata. Liita koko teksti suoraan tekstikenttään, tai tiedostoon, jonka voit lähettää.
it: Sfortunatamente Revita non è stata in grado di estrarre il testo<br/> Copia il testo nell'apposito spazio per il caricamento,<br/> oppure copialo su un file e carica il file.
ru: К сожалению, Ревита не может извлечь текст из этой веб-страницы!<br> Пожалуйста, скопируйте текст в поле для загрузки.<br> Или скопируйте текст в файл и загрузите в Ревиту, используя кнопки для загрузки файлов.

source: Fetching the story from the Web page failed!<br/> Please paste the text into the upload textbox;<br/> or paste the text into a file and upload the file.
fi: Valittua sivua ei voi ladata. Liita koko teksti suoraan tekstikenttään, tai tiedostoon, jonka voit lähettää.
it: Non è stato possibile estrarre la storia dal Web!<br/> Copia il testo nell'apposito spazio per il caricamento,<br/> oppure copia il testo su un file e carica il file.
ru: К сожалению, Ревита не может извлечь текст из этой веб-страницы!<br> Пожалуйста, скопируйте текст в поле для загрузки.<br> Или скопируйте текст в файл и загрузите в Ревиту, используя кнопки для загрузки файлов.

source: Stories Flashcards
fi: Tarinan kysymyskortit
it: Fleshcard sulla storia
ru: Флеш-карты из текста

source: A story with the same title already exists! Please try again with a different title!
fi: Samanniminen teksti on jo olemassa. Valitse muu otsikko.
it: Esiste già una storia con lo stesso titolo! Per favore, prova ad inserirne un altro titolo!
ru: Текст с таким названием уже существует. Выберите текст с другим названием.

source: Language of the text does not correspond to the current language:
fi: Tekstin kieli ei vastaa valittua kieltä:
it: La lingua del testo non corrisponde alla lingua che stai imparando:
ru: Язык загружаемого текста не соответствует изучаемому языку:
