Repository: UniversityOfHelsinkiCS/mobvita
Catalog: client/util/translations/revita/*/LC_MESSAGES/messages.po
Languages: fi, it, ru

source: Nouns. Type C, C1: stress on the stem in singular, on the ending in plural
fi: Substantiivit. Tyyppi C, C1: Paino yksikössä vartalolla, monikossa päätteellä.
it: Sostantivi. Tipologia C,C1: accento sulla base al singolare, sulla terminazione al plurale
ru: Существительные. Тип C, C1: ударение на основе в ед. ч., на окончании во мн. ч

source: Nouns. Type D, D1: stress on the ending in singular, on the stem in plural
fi: Substantiivit. Tyyppi D, D1: Paino yksikössä päätteellä, monikossa vartalolla.
it: Sostantivi. Tipologia D,D1: accento sulla terminazione al singolare, sulla base al plurale
ru: Существительные. Тип D, D1: ударение на окончании в ед. ч., на основе во мн. ч

source: Nouns. Type 'нож-ножом, сторож-сторожем'
fi: Substantiivit. Tyyppi нож - ножом, сторож - сторожем.
it: Sostantivi. Tipologia 'нож - ножом, сторож - сторожем'
ru: Существительные. Тип 'нож - ножом, сторож - сторожем'

source: Declension of adjectives. Type 'хорошего'
fi: Adjektiivit. Tyyppi хорошего.
it: Declinazione degli aggettivi. Tipologia 'хорошего'
ru: Склонение прилагательных. Тип 'хорошего'

source: Place of adverbs of time, place and manner
fi: Ajan, paikan ja tavan adverbiaalin paikka.
it: Posizione degli avverbi di tempo, luogo e modo
ru: Место наречий времени, места и образа действия

source: Place of negation in the sentence
fi: Kieltosanan paikka.
it: Posizione della negazione nella frase
ru: Место отрицания в предложении

source: Place of participles in the sentence
fi: Partisiippirakenteen määreiden paikka.
it: Posizione del participio nella frase
ru: Место причастного оборота в предложении

source: Place of gerunds in the sentence
fi: Gerundirakenteen paikka virkkeessä.
it: Posizione del gerundio nella frase
ru: Место деепричастного оборота в предложении

source: Place of pronouns in a phrase
fi: Pronominin paikka.
it: Posizione del pronome nella frase
ru: Место местоимения во фразе

source: Word order in sentences introducing direct quotations
fi: Johtolauseen sanajärjestys.
it: Ordine delle parole nella frase introducente discorso diretto
ru: Порядок слов в предложении, вводящем прямую речь

source: Second person singular imperative in conditionals ('если')
fi: Yksikön 2. persoonan imperatiivi merkityksessä 'jos'.
it: Seconda persona singolare dell'imperativo con significato condizionale ('если')
ru: 2 лицо ед. ч. императива в условном значении ('если')

source: Usage of 'сам' and 'один'
fi: Сам ja один sanojen käyttö.
it: Uso delle parole 'сам' e 'один'
ru: Употребление слов 'сам' и 'один'

source: Sentences of type 'Знаю его как врача.'
fi: Знаю его как врача.
it: Frasi del tipo 'Знаю его как врача.'
ru: Предложения типа 'Знаю его как врача.'

source: Sentences of type 'Быть грозе'
fi: Tyyppi Быть грозе.
it: Frasi del tipo 'Быть грозе'
ru: Предложения типа 'Быть грозе'

source: Sentences of type 'Лодку унесло ветром'
fi: Tyyppi Лодку унесло ветром.
it: Frasi del tipo 'Лодку унесло ветром'
ru: Предложения типа 'Лодку унесло ветром'

source: Genitive plural
fi: Monikon genetiivi.
it: Caso genitivo plurale
ru: Родительный падеж множественного числа

source: Frequent prefixed verbs of motion + prepositional constructions
fi: Tavallisimmat etuliitteiset liikeverbit + prepositiorakenteet.
it: Verbi prefissati di moto frequenti + costrutti prepositivi
ru: Частотные приставочные глаголы движения + предложные конструкции

source: Animate noun object
fi: Elollisen substantiivin objektin sija.
it: Sostantivi animati in qualità di complemento
ru: Одушевленные существительные в качестве дополнения

source: Unprefixed verbs of motion
fi: Etuliitteettömät liikeverbit.
it: Verbi di moto non prefissati
ru: Бесприставочные глаголы движения

source: Unstressed fleeting vowels in roots and suffixes of nouns and adjectives
fi: Painottomia väistyviä vokaaleja: substantiivien ja adjektiivien juurimorfit ja suffiksit
it: Vocali fuggevoli non accentate nelle radici e suffisi di nomi e aggettivi
ru: Безударные беглые гласные в корнях и суффиксах имен существительных и прилагательных

source: Unstressed vowels in verbal forms
fi: Painottomia vokaaleja: verbien muodot
it: Vocali non accentate nelle forme verbali
ru: Безударные гласные в глагольных формах

source: Unstressed vowels in roots
fi: Painottomia vokaaleja: juurimorfit
it: Vocali non accentate nelle radici
ru: Безударные гласные в корнях

source: Unstressed vowels in case endings
fi: Painottomia vokaaleja: sijamuodot
it: Vocali non accentate nelle terminazioni dei casi
ru: Безударные гласные в падежных окончаниях

source: Unstressed vowels in prefixes
fi: Painottomia vokaaleja: prefiksit
it: Vocali non accentate nei prefissi
ru: Безударные гласные в приставках

source: Unstressed vowels in suffixes
fi: Painottomia vokaaleja: suffiksit
it: Vocali non accentate nei suffisi
ru: Безударные гласные в суффиксах

source: Unstressed vowels linking compounds
fi: Painottomia yhdistäviä vokaaleja
it: Vocali d'unione non accentate
ru: Безударные соединительные гласные

source: Unstressed particles не and ни
fi: Painottomia не ja ни partikkeleita
it: Particelle non accentate не и ни
ru: Безударные частицы не и ни

source: Letter г in ending -ого (-его)
fi: Г-kirjain -ого/-его -sijamuodoissa
it: Lettera г nella terminazione -ого (-его)
ru: Буква г в окончании -ого (-его)

source: Letter й
fi: Й-kirjain
it: Lettera й
ru: Буква й

source: Letter ч and ш before н and т
fi: Ч ja Ш-kirjaimet ennen н ja т
it: Lettere ч e ш davanti a н и т
ru: Буквы ч и ш перед н и т

source: Letters ъ and ь:
fi: Ъ ja ь-kirjaimet
it: Lettere ъ e ь:
ru: Буквы ъ и ь:

source: Vowels in verbal endings
fi: Vokaaleja verbien muodoissa
it: Vocali nelle terminazioni verbali
ru: Гласные в глагольных окончаниях

source: Vowels in the infinitive (indefinite form) before -ть
fi: Vokaaleja infinitiivissä (ennen -ть)
it: Vocali nell'infinito (forma indefinita) davanti a -ть
ru: Гласные в инфинитиве (неопределенной форме) перед -ть

source: Vowels not after sibilants and ц
fi: Vokaaleja EI suhusibilanttien tai Ц jälkeen
it: Vocali non dopo le sibilanti e ц
ru: Гласные не после шипящих и ц

source: Vowels after sibilants and ц
fi: Vokaaleja suhusibilanttien tai Ц jälkeen
it: Vocali dopo le sibilanti e ц
ru: Гласные после шипящих и ц

source: Voiceless and voiced consonants
fi: Soinnittomat ja soinnilliset konsonantit
it: Consonanti sorde e sonore
ru: Глухие и звонкие согласные

source: Consonant clusters at the juncture of morphemes
fi: Konsonanttiryhmät affiksien rajassa
it: Gruppi di consonanti nei punti di giunzione dei morfemi
ru: Группы согласных на стыке значимых частей слова

source: Double and single -н- in suffixes of adjectives and nouns
fi: Yksin- ja kahdenkertainen -н-/-нн-: substantiivien ja adjektiivien suffiksit
it: Doppia -н- и singola -н- nei suffissi di aggettivi e sostantivi
ru: Двойное -н- и одно -н- в суффиксах прилагательных и существительных

source: Double and single -н- in suffixes of full and short forms of adjectives
fi: Yksin- ja kahdenkertainen -н-/-нн-: pitkin ja lyhyin adjektiivien suffiksit
it: Doppia -н- и singola-н- nei suffissi di forme piene e brevi degli aggettivi
ru: Двойное -н- и одно -н- в суффиксах полных и кратких форм прилагательных

source: Double and single -н- in suffixes of past passive participles and corresponding adjectives
fi: Yksin- ja kahdenkertainen -н-/-нн-: passiivin partisiipin preteritin ja vastaavien adjek
it: Doppia -н- и singola -н- nei suffissi di participi passati passivi e negli aggettivi corrispondenti
ru: Двойное -н- и одно -н- в суффиксах страдательных причастий прошедшего времени и соотносительных с ними прилагательных

source: Double and single -н- in words derived from adjectives and participles
fi: Yksin- ja kahdenkertainen -н-/-нн-: adjektivisitä ja partisipista muodostetuja sanoja
it: Doppia н e singola н in parole formate da aggettivi e participi
ru: Двойное н и одно н в словах, образованных от прилагательных и причастий

source: Double consonants in borrowed roots and suffixes
fi: Toistuvat konsonantit: lainattuissa juurimorfit ja suffiksit
it: Doppie consonanti in radici prese in prestito e suffisi
ru: Двойные согласные в иноязычных корнях и суффиксах

source: Double consonants in native roots
fi: Toistuvat konsonantit: venäläisiä juurimorfeja
it: Doppie consonanti in radici russe
ru: Двойные согласные в русских корнях

source: Double consonants at morpheme juncture
fi: Toistuvat konsonantit affiksien rajassa
it: Doppie consonanti nei punti di giunzione dei morfemi
ru: Двойные согласные на стыке значимых частей слова

source: Silent consonants
fi: Ääntymättömät konsonantit
it: Consonanti non pronunciate
ru: Непроизносимые согласные

source: Peculiarities of spelling of certain roots
fi: Erikoistapauksia juurimorfeissa
it: Particolarità della scrittura di radici separate
ru: Особенности написания отдельных корней

source: Peculiarities of spelling of certain suffixes
fi: Erikoistapauksia suffikseissa
it: Particolarità della scrittura di suffissi separati
ru: Особенности написания отдельных суффиксов

source: Joint vs. separate spelling of negation 'не': verb (+participles)
fi: Yhdys- ja erillissanat: не + verbit ja partisiipit
it: Scrittura unita e separata con la negazione не: verbo (+participi)
ru: Слитное и раздельное написания с отрицанием не: глагол (+причастия)

source: Joint vs. separate spelling of negation 'не': pronoun
fi: Yhdys- ja erillissanat: не + pronominit
it: Scrittura unita e separata con la negazione не: pronome
ru: Слитное и раздельное написания с отрицанием не: местоимение

source: Joint vs. separate spelling of negation 'не': adverb (+'несколько')
fi: Yhdys- ja erillissanat: не + adverbit
it: Scrittura unita e separata con la negazione не: avverbio (+'несколько')
ru: Слитное и раздельное написания с отрицанием не: наречие (+'несколько')

source: Joint vs. separate spelling of negation 'не': adjectives (+full-short)
fi: Yhdys- ja erillissanat: не + pitkät VS lyhyt adjektiivit
it: Scrittura unita e separata con la negazione не : aggettivi (+brevi-pieni)
ru: Слитное и раздельное написания с отрицанием не: прилагательные (+краткие-полные)

source: Joint vs. separate spelling of negation 'не': noun
fi: Yhdys- ja erillissanat: не + substantiivit
it: Scrittura unita e separata con la negazione не: sostantivo
ru: Слитное и раздельное написания с отрицанием не: существительное

source: Joint vs. hyphenated spelling: adjectives
fi: Yhdys- ja erillissanat: adjektiivit
it: Scrittura unita e con trattino: aggettivi
ru: Слитное, дефисное и раздельное написание: имена прилагательные

source: Joint vs. hyphenated spelling: numerals
fi: Yhdys- ja erillissanat: numeraalit
it: Scrittura unita e con trattino: numerali
ru: Слитное, дефисное и раздельное написание: имена числительные

source: Joint vs. hyphenated spelling: pronouns
fi: Yhdys- ja erillissanat: pronominit
it: Scrittura unita e con trattino: pronomi
ru: Слитное, дефисное и раздельное написание: местоимения

source: Joint vs. hyphenated spelling: adverbs
fi: Yhdys- ja erillissanat: adverbit
it: Scrittura unita e con trattino: avverbi
ru: Слитное, дефисное и раздельное написание: наречия

source: Joint vs. hyphenated spelling: common nouns
fi: Yhdys- ja erillissanat: yleisnimet
it: Scrittura unita e con trattino: nomi comuni
ru: Слитное, дефисное и раздельное написание: нарицательные имена

source: Joint vs. hyphenated spelling: function words
fi: Yhdys- ja erillissanat: partikkelit
it: Scrittura unita e con trattino:parole funzionali
ru: Слитное, дефисное и раздельное написание: служебные слова

source: Joint vs. hyphenated spelling: proper names
fi: Yhdys- ja erillissanat: erisnimet
it: Scrittura unita e con trattino: nomi propri
ru: Слитное, дефисное и раздельное написание: собственные имена

source: Capitalized vs. lowercase
it: Scrittura unita e con trattino

source: Capitalized vs. lowercase: astronomical/geographical names
fi: Isot ja pienet kirjaimet: astronomisia ja maantieteellisia nimiä
it: Uso di lettere maiuscole e minuscole: nomi astronomici/geografici
ru: Употребление прописных и строчных букв: астрономические/географические названия

source: Capitalized vs. lowercase: posts, titles, awards
fi: Isot ja pienet kirjaimet: virran, arvon ja palkinnon nimiä
it: Uso di lettere maiuscole e minuscole: nomi degli incarichi, ranghi e onorificenze
ru: Употребление прописных и строчных букв: названия должностей, званий, наград

source: Capitalized vs. lowercase: names of official organizations
fi: Isot ja pienet kirjaimet: laitoksen ja toimiston nimiä
it: Uso di lettere maiuscole e minuscole: nomi di organi ufficiali, istituzioni
ru: Употребление прописных и строчных букв: названия официальных органов, учреждений

source: Capitalized vs. lowercase: names linked to religion, historical epochs and events
fi: Isot ja pienet kirjaimet: uskontoa, aikakausia ja historiallisia tapahtumia koskevia nim
it: Uso di lettere maiuscole e minuscole: nomi correlati a religione, epoche storiche ed eventi
ru: Употребление прописных и строчных букв: названия связанные с религией, историческими эпохами и событиями

source: Capitalized vs. lowercase: names of trademarks, documents, works of art
fi: Isot ja pienet kirjaimet: tavaramerkkien, asiapaperien ja taideteoksien nimiä
it: Uso di lettere maiuscole e minuscole: marchi commerciali , documenti, opere d'arte
ru: Употребление прописных и строчных букв: названия товарных знаков, документов, произведений искусства

source: Capitalized vs. lowercase: proper names of persons, animals
fi: Isot ja pienet kirjaimet: ihmisten ja eläimien nimiä
it: Uso di lettere maiuscole e minuscole: nomi propri di uomini, animali
ru: Употребление прописных и строчных букв: собственные имена людей, животных

source: Adjective other
it: Agettivo (altro)

source: Numeral ordinal other
it: Numeri ordinali

source: Numeral cardinal other
it: Numeri cardinali

source: Choose the word best fitting the definition.
fi: Valitse määritelmää vastaava sana.
it: Scegli la parola più adatta alla definizione
ru: Выберите слово, соответствующее определению.

source: Which word or expression does NOT fit the given word?
fi: Mikä sana tai ilmaisu ei olisi luonteva annetun sanan yhteydessä
it: Quale parola o espressione NON si abbina alla parola data?
ru: Какое слово или выражение НЕ подходит к данному слову?

source: Choose the best fitting answer to the question.
fi: Valitse mielestäsi luontevampi vastaus kuulemaasi kysymykseen.
it: Scegli la risposta che è più corretta
ru: Выберите наиболее подходящий ответ на вопрос.

source: Would this be a fitting answer to the question?
fi: Olisiko luontevaa vastata näin?
it: Si può rispondere così?
ru: Можно ли так ответить на вопрос?

source: Choose the proper stress.
fi: Valitse oikea sanapaino.
it: Scegli il giusto accento
ru: Выберите правильное ударение.

source: Which sentence sounds more natural?
fi: Kummassa lauseessa on mielestäsi neutraali sanajärjestys?
it: Quale delle due proposizioni suona più naturale?
ru: Какое из двух предложений звучит более естественно?

source: Choose the more natural version.
fi: Valitse mielestäsi luontevampi vaihtoehto.
it: Scegli la variante più naturale
ru: Выберите наиболее естественный вариант.

source: Which sentence best fits the Finnish sentence?
fi: Kumpi lause vastaa paremmin suomalaista lausetta?
it: Quale proposizione si adatta meglio alla frase in finlandese?
ru: Какое предложение лучше соответствует финскому предложению?

source: Is it correct to say this?
fi: Voidaanko näin sanoa?
it: È giusto dire così?
ru: Можно ли так сказать?

source: Which sentence has the correct word order?
fi: Kummassa lauseessa on oikea sanajärjestys?
it: Quale proposizione presenta l'ordine corretto delle parole?
ru: В каком предложении правильный порядок слов?

source: Which sentence better fits the described situation?
fi: Kumpi lause sopii paremmin kuvattuun tilanteeseen?
it: Quale proposizione si adatta meglio alla situazione descritta?
ru: Какое предложение лучше подходит к описанной ситуации?

source: Choose the correct way of writing the word or expression.
fi: Valitse sanan oikea kirjoitusasu.
it: Scegli il modo corretto di scrivere la parola
ru: Выберите правильное написание слова.

source: Choose the correct way of writing.
fi: Valitse oikea kirjoitusasu.
it: Scegli la giusta scrittura
ru: Выберите правильное написание.

source: Is it correct to write this way?
fi: Voidaanko näin kirjoittaa?
it: Si può scrivere in questo modo?
ru: Можно ли так написать?

source: Choose the best fitting verb.
fi: Valitse yhteyteen sopiva verbi.
it: Scegli il verbo adeguato
ru: Выберите подходящий глагол.

source: Choose the word or phrase which best fits the explanation below
fi: Valitse sana, joka tarkoittaa samaa kuin vasemmalla oleva selitys.
it: Scegli la parola o la frase che più si adattano alla spiegazione
ru: Выберите слово или фразу наиболее подходящюю объяснению

source: Yes
fi: Kyllä
it: Si
ru: Да

source: Adjective inflection
fi: Adjektiivien taivutus
it: La declinazione degli aggettivi
ru: Склонение прилагательных

source: Word order
fi: Sanajärjestys
it: Ordine delle parole
ru: Порядок слов

source: Aspect and tense
fi: Aspektien ja aikamuotojen käyttö
it: Aspetti e tempi
ru: Употребление вида и времени

source: Collocation
fi: Kollokaatio
it: Collocazione
ru: Коллокация

source: Verbs of motion
fi: Liikeverbit
it: I verbi di moto
ru: Глаголы движения

source: Numerals
fi: Lukusanat
it: I numerali
ru: Числительные

source: Verbal government
fi: Verbien rektio
it: La reggenza dei verbi
ru: Глагольное управление

source: Stress
fi: Sanapaino
it: L'accento
ru: Ударение

source: Verb conjugation
fi: Verbien taivutus
it: La coniugazione dei verbi
ru: Спряжение глаголов

source: Noun inflection
fi: Substantiivien taivutus
it: La declinazione dei sostantivi
ru: Склонение существительных

source: Syntax
fi: Syntaksi
it: Sintassi
ru: Синтаксис

source: Orthography
fi: Oikeuskirjoitus
it: Ortografia
ru: Орфография

source: Lexicon
fi: Sanasto
it: Vocabolario
ru: Словарный запас

source: Infinitive 3 illative
fi: Infinitiivi 3 illatiivi
it: Il terzo infinitivo e l'illativo
ru: Третий инфинитив и иллатив

source: Partitive object (negative)
fi: Partitiivi objekti (negatiivi)
it: L'oggetto al partitivo (la negazione)
ru: Объект в партитиве (отрицание)

source: Allative case
fi: Allatiivi
it: Il caso allativo
ru: Аллативный падеж

source: Accusative case
fi: Akkusatiivi
it: Il caso accusativo
ru: Винительный падеж

source: Partitive case
fi: Partitiivi
it: Il caso partitivo
ru: Партитивный падеж

source: Syntax: conjunctions
fi: Syntaksi: konjunktiot
it: Sintassi: le congiunzioni
ru: Синтаксис: союзы

source: Lexicon: definitions
fi: Sanasto: määritelmät
it: Vocabolario: definizioni
ru: Словарный запас: определения

source: Case usage
fi: Sijamuotojen käyttö
it: L'uso dei casi
ru: Использование падежей

source: Verb infinitives 1-4
fi: Verbijen infinitiivit 1-4
it: Gli infinitivi 1-4
ru: Инфинитивы 1-4

source: Verb covernment: cases
fi: Verbien hallinto: sijamuodot
it: La reggenza dei verbi: i casi
ru: Глагольное управление: падежи

source: Noun & Adjective inflection
it: Flessione del sostantivo e dell'aggettivo

source: Noun. Type "talo"
it: Sostantivo. Tipo "talo"

source: Noun. Type "koira/koiria"
it: Sostantivo. Tipo "koira/koiria"

source: Noun. Type "kala/kaloja"
it: Sostantivo. Tipo "kala/kaloja"

source: Noun. Type "bussi/n"
it: Sostantivo. Tipo "bussi/n"

source: Noun. Type "ovi/oven"
it: Sostantivo. Tipo "ovi/oven"

source: Noun. Type "maa/suo/valtio"
it: Sostantivo. Tipo "maa/suo/valtio"

source: Noun. Type "uusi"
it: Sostantivo. Tipo "uusi"

source: Noun. Type "mansikka/mansikoita"
it: Sostantivo. Tipo "mansikka/mansikoita"

source: Noun. Type "aihe"
it: Sostantivo. Tipo "aihe"

source: Noun. Type "valas/valaan"
it: Sostantivo. Tipo "valas/valaan"

source: Noun. Type "nainen"
it: Sostantivo. Tipo "nainen"

source: Noun. Type "tytär/ien/joutsen"
it: Sostantivo. Tipo "tytär/ien/joutsen"

source: Noun. Type "kannel"
it: Sostantivo. Tipo "kannel"

source: Noun. Type "koditon"
it: Sostantivo. Tipo "koditon"

source: Noun. Type "kysymys/vastaus"
it: Sostantivo. Tipo "kysymys/vastaus"

source: Noun. Type "uutuus"
it: Sostantivo. Tipo "uutuus"

source: Noun. Type "puhelin"
it: Sostantivo. Tipo "puhelin"

source: Noun. Type "olut/kevät"
it: Sostantivo. Tipo "olut/kevät"

source: Noun, other
it: Altri sostantivi

source: Verb inflection
fi: Verbi
it: Verbo
ru: Спряжение глагола

source: Type
it: Tipo

source: Verb. Type "sanoa/muistaa/tuntea"
it: Verbo. Tipo "sanoa/muistaa/tuntea"

source: Verb. Type "voida/saada/juoda/käydä"
it: Verbo Tipo "voida/saada/juoda/käydä"

source: Verb. Type "tehdä"
it: Verbo. Tipo "tehdä"

source: Verb. Type "tulla/purra/kävellä"
it: Verbo. Tipo "tulla/purra/kävellä"

source: Verb. Type "juosta"
it: Verbo. Tipo "juosta"

source: Verb. Type "nousta"
it: Verbo. Tipo "nousta"

source: Verb. Type "haluta/katketa/salata"
it: Verbo. Tipo "haluta/katketa/salata"

source: Verb. Type "tarvita/reagoida"
it: Verbo. Tipo "tarvita/reagoida"

source: Verb. Type "vanheta"
it: Verbo. Tipo "vanheta"

source: Verb. Type other
it: Altri verbi

source: Mood
it: Modo

source: Indicative
it: Indicativo

source: Imperative mood
it: Imperativo

source: Conditional mood
it: Condizionale

source: Potential mood
it: Potenziale

source: Voice
it: Diatesi

source: Active Voice
it: Activa

source: Passive (Impersonal)
it: Passiva

source: Tense
it: Tempo

source: Present
it: Presente

source: Imperfect
it: Imperfecto

source: Perfect
it: Perfecto

source: Pluperfect
it: Pluperfecto

source: Negation
it: Negazione

source: Positive
it: Positivo

source: Negative
it: Negativo

source: Participle
it: Participio

source: Active
it: Activo

source: Passive
it: Passivo

source: Present Participle
it: Participio presente

source: Past Participle
it: Participio passato

source: Agentive Participle
it: Participio agentivo

source: Infinitive
it: Infinitivo

source: Infinitive I
it: Infinitivo I

source: Infinitive II
it: Infinitivo II

source: Infinitive III
it: Infinitivo III

source: Infinitive IV
it: Infinitivo IV

source: Infinitive V
it: Infinitivo V

source: Government
it: Reggenza

source: Postposition/Preposition. Case government (of Noun+Pronoun)
it: Reggenza di postposizione/preposizione

source: Adverbs
fi: Adverbi
it: Avverbio
ru: Наречия

source: Pronouns
fi: Pronomini
it: Pronome
ru: Местоимения

source: Others
it: Altri

source: Flash Cards for
fi: Kysymyskortit
it: Flashcard per
ru: Флеш-карты из

source: Translation
fi: Käännä
it: Traduzione in
ru: Перевод на

source: Fill in
fi: Käännä
it: Traduzione
ru: Перевод

source: Browse (flashcards)
fi: Selaa
it: Sfoglia flashcard
ru: Просмотр

source: Multi choice
fi: Monivalinta
it: Scelta multipla
ru: Выбор

source: Next card
fi: Seuraava kortti
it: Flashcard successiva
ru: Следующая флеш-карта...

source: Back to my flashcards
fi: Takaisin kysymyskortteihini
it: Torna alle fleshcard
ru: Назад к флеш-картам

source: Add new flashcard
fi: Lisää kysymyskortti
it: Aggiungi nuove flashcard
ru: Добавить новые флеш-карты

source: Delete this flashcard
fi: Poista tämä kysymyskortti
it: Elimina la flashcard
ru: Удалить флеш-карту

source: Edit this flashcard
fi: Muokkaa tätä kysmyskorttia
it: Modifica la flashcard
ru: Редактировать флеш-карту

source: Check answer!
fi: Tarkista
it: Controlla
ru: Проверить

source: Check your answer
fi: Tarkista
it: Controlla
ru: Проверить

source: Flip
fi: Käännä
it: Gira
ru: Перевернуть

source: I know it
fi: Tiedän tämän
it: Conosco questa parola
ru: Я знаю это слово

source: I am not sure
fi: En ole varma
it: Non conosco questa parola
ru: Я не знаю это слово

source: Back of the card
fi: Kortin kääntöpuoli
it: Traduzione
ru: Перевод

source: New word
fi: Uusi sana
it: Una nuova parola
ru: Новое слово
